using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace De.AHoerstemeier.Tambon
{
    /// <summary>
    /// Helper class to access http://amphoe.com
    /// </summary>
    public static class AmphoeComHelper
    {
        #region consts

        #region _provinceToAmphoeCom

        private static Dictionary<UInt32, Int16> _provinceToAmphoeCom = new Dictionary<UInt32, Int16>() {
            { 81,1},
            { 71,2},
            { 46,3},
            { 62,4},
            { 40,5},
            { 22,6},
            { 24,7},
            { 20,8},
            { 18,9},
            { 36,10},
            { 86,11},
            { 57,12},
            { 50,13},
            { 92,14},
            { 23,15},
            { 63,16},
            { 26,17},
            { 73,18},
            { 48,19},
            { 30,20},
            { 80,21},
            { 60,22},
            { 12,23},
            { 96,24},
            { 55,25},
            { 31,26},
            { 13,27},
            { 77,28},
            { 25,29},
            { 94,30},
            { 14,31},
            { 56,32},
            { 82,33},
            { 93,34},
            { 66,35},
            { 65,36},
            { 76,37},
            { 67,38},
            { 54,39},
            { 83,40},
            { 44,41},
            { 49,42},
            { 58,43},
            { 35,44},
            { 95,45},
            { 45,46},
            { 85,47},
            { 21,48},
            { 70,49},
            { 16,50},
            { 52,51},
            { 51,52},
            { 42,53},
            { 33,54},
            { 47,55},
            { 90,56},
            { 91,57},
            { 11,58},
            { 75,59},
            { 74,60},
            { 27,61},
            { 19,62},
            { 17,63},
            { 64,64},
            { 72,65},
            { 84,66},
            { 32,67},
            { 43,68},
            { 39,69},
            { 15,70},
            { 37,71},
            { 41,72},
            { 53,73},
            { 61,74},
            { 34,75},
        };

        #endregion _provinceToAmphoeCom

        #region _geocodeToAmphoeCom

        private static Dictionary<UInt32, Int16> _geocodeToAmphoeCom = new Dictionary<UInt32, Int16>()
        {
            #region Krabi

            // AMP[1][0]=new Array('-- อำเภอ --','อำเภอเมืองกระบี่' ,'อำเภอเหนือคลอง' ,'อำเภอเขาพนม' ,'อำเภอเกาะลันตา' ,'อำเภอคลองท่อม' ,'อำเภอลำทับ' ,'อำเภออ่าวลึก' ,'อำเภอปลายพระยา'  );
            // AMP[1][1]= new Array('-1','1' ,'2' ,'3' ,'4' ,'5' ,'6' ,'7' ,'8'  );

            { 8101, 1 }, // เมืองกระบี่
            { 8102, 3 }, // เขาพนม
            { 8103, 4 }, // เกาะลันตา
            { 8104, 5 }, // คลองท่อม
            { 8105, 7 }, // อ่าวลึก
            { 8106, 8 }, // ปลายพระยา
            { 8107, 6 }, // ลำทับ
            { 8108, 2 }, // เหนือคลอง
            #endregion Krabi

            #region Kanchanaburi

            //AMP[2][0]=new Array('-- อำเภอ --','อำเภอเมืองกาญจนบุรี' ,'อำเภอด่านมะขามเตี้ย' ,'อำเภอไทรโยค' ,'อำเภอบ่อพลอย' ,'อำเภอหนองปรือ' ,'อำเภอศรีสวัสดิ์' ,'อำเภอท่ามะกา' ,'อำเภอท่าม่วง' ,'อำเภอทองผาภูมิ' ,'อำเภอสังขละบุรี' ,'อำเภอพนมทวน' ,'อำเภอห้วยกระเจา' ,'อำเภอเลาขวัญ'  );
            //AMP[2][1]= new Array('-1','9' ,'10' ,'11' ,'12' ,'13' ,'14' ,'15' ,'16' ,'17' ,'18' ,'19' ,'20' ,'21'  );

            { 7101, 9 }, // เมืองกาญจนบุรี
            { 7102, 11 }, // ไทรโยค
            { 7103, 12 }, // บ่อพลอย
            { 7104, 14 }, // ศรีสวัสดิ์
            { 7105, 15 }, // ท่ามะกา
            { 7106, 16 }, // ท่าม่วง
            { 7107, 17 }, // ทองผาภูมิ
            { 7108, 18 }, // สังขละบุรี
            { 7109, 19 }, // พนมทวน
            { 7110, 21 }, // เลาขวัญ
            { 7111, 10 }, // ด่านมะขามเตี้ย
            { 7112, 13 }, // หนองปรือ
            { 7113, 20 }, // ห้วยกระเจา
            #endregion Kanchanaburi

            #region Kalasin

            //AMP[3][0]=new Array('-- อำเภอ --','อำเภอเมืองกาฬสินธุ์' ,'อำเภอนามน' ,'อำเภอกมลาไสย' ,'อำเภอร่องคำ' ,'อำเภอกุฉินารายณ์' ,'อำเภอเขาวง' ,'อำเภอยางตลาด' ,'อำเภอห้วยเม็ก' ,'อำเภอสหัสขันธ์' ,'อำเภอคำม่วง' ,'อำเภอท่าคันโท' ,'อำเภอหนองกุงศรี' ,'อำเภอสมเด็จ' ,'อำเภอห้วยผึ้ง' ,'กิ่งอำเภอสามชัย' ,'กิ่งอำเภอนาคู' ,'กิ่งอำเภอฆ้องชัย' ,'กิ่งอำเภอดอนจาน'  );
            //AMP[3][1]= new Array('-1','22' ,'23' ,'24' ,'25' ,'26' ,'27' ,'28' ,'29' ,'30' ,'31' ,'32' ,'33' ,'34' ,'35' ,'851' ,'852' ,'853' ,'854'  );
            { 4601, 22 }, // เมืองกาฬสินธุ์
            { 4602, 23 }, // นามน
            { 4603, 24 }, // กมลาไสย
            { 4604, 25 }, // ร่องคำ
            { 4605, 26 }, // กุฉินารายณ์
            { 4606, 27 }, // เขาวง
            { 4607, 28 }, // ยางตลาด
            { 4608, 29 }, // ห้วยเม็ก
            { 4609, 30 }, // สหัสขันธ์
            { 4610, 31 }, // คำม่วง
            { 4611, 32 }, // ท่าคันโท
            { 4612, 33 }, // หนองกุงศรี
            { 4613, 34 }, // สมเด็จ
            { 4614, 35 }, // ห้วยผึ้ง
            { 4615, 851 }, // สามชัย
            { 4616, 852 }, // นาคู
            { 4617, 854 }, // ดอนจาน
            { 4618, 853 }, // ฆ้องชัย
            #endregion Kalasin

            #region Kamphaeng Phet

            //AMP[4][0]=new Array('-- อำเภอ --','อำเภอเมืองกำแพงเพชร' ,'อำเภอคลองลาน' ,'อำเภอไทรงาม' ,'อำเภอขาณุวรลักษบุรี' ,'อำเภอคลองขลุง' ,'อำเภอทรายทองวัฒนา' ,'อำเภอปางศิลาทอง' ,'อำเภอพรานกระต่าย' ,'อำเภอลานกระบือ' ,'กิ่งอำเภอโกสัมพีนคร' ,'กิ่งอำเภอบึงสามัคคี'  );
            //AMP[4][1]= new Array('-1','36' ,'37' ,'38' ,'39' ,'40' ,'41' ,'42' ,'43' ,'44' ,'833' ,'834'  );
            { 6201, 36 }, // เมืองกำแพงเพชร
            { 6202, 38 }, // ไทรงาม
            { 6203, 37 }, // คลองลาน
            { 6204, 39 }, // ขาณุวรลักษบุรี
            { 6205, 40 }, // คลองขลุง
            { 6206, 43 }, // พรานกระต่าย
            { 6207, 44 }, // ลานกระบือ
            { 6208, 41 }, // ทรายทองวัฒนา
            { 6209, 42 }, // ปางศิลาทอง
            { 6210, 834 }, // บึงสามัคคี
            { 6211, 833 }, // โกสัมพีนคร
            #endregion Kamphaeng Phet

        //AMP[5][0]=new Array('-- อำเภอ --','อำเภอเมืองขอนแก่น' ,'อำเภอบ้านฝาง' ,'อำเภอพระยืน' ,'อำเภอหนองเรือ' ,'อำเภอชุมแพ' ,'อำเภอสีชมพู' ,'อำเภอน้ำพอง' ,'อำเภออุบลรัตน์' ,'อำเภอกระนวน' ,'อำเภอบ้านไผ่' ,'อำเภอเปือยน้อย' ,'อำเภอพล' ,'อำเภอแวงใหญ่' ,'อำเภอแวงน้อย' ,'อำเภอหนองสองห้อง' ,'อำเภอภูเวียง' ,'อำเภอมัญจาคีรี' ,'อำเภอชนบท' ,'อำเภอเขาสวนกวาง' ,'อำเภอภูผาม่าน' ,'กิ่งอำเภอซำสูง' ,'กิ่งอำเภอโคกโพธิ์ชัย' ,'กิ่งอำเภอหนองนาคำ' ,'กิ่งอำเภอบ้านแฮด' ,'กิ่งอำเภอโนนศิลา'  );
        //AMP[5][1]= new Array('-1','45' ,'46' ,'47' ,'48' ,'50' ,'51' ,'52' ,'53' ,'54' ,'55' ,'56' ,'57' ,'58' ,'59' ,'60' ,'61' ,'62' ,'63' ,'64' ,'65' ,'855' ,'856' ,'857' ,'858' ,'859'  );
        //AMP[6]=new Array(2);
        //AMP[6][0]=new Array('-- อำเภอ --','อำเภอเมืองจันทบุรี' ,'อำเภอขลุง' ,'อำเภอท่าใหม่' ,'อำเภอโป่งน้ำร้อน' ,'อำเภอมะขาม' ,'อำเภอแหลมสิงห์' ,'อำเภอสอยดาว' ,'อำเภอแก่งหางแมว' ,'อำเภอนายายอาม' ,'กิ่งอำเภอเขาคิชฌกูฏ'  );
        //AMP[6][1]= new Array('-1','67' ,'68' ,'69' ,'70' ,'71' ,'72' ,'73' ,'74' ,'75' ,'76'  );
        //AMP[7]=new Array(2);
        //AMP[7][0]=new Array('-- อำเภอ --','อำเภอเมืองฉะเชิงเทรา' ,'อำเภอบางคล้า' ,'อำเภอบางน้ำเปรี้ยว' ,'อำเภอบางปะกง' ,'อำเภอบ้านโพธิ์' ,'อำเภอพนมสารคาม' ,'อำเภอราชสาส์น' ,'อำเภอสนามชัยเขต' ,'อำเภอแปลงยาว' ,'อำเภอท่าตะเกียบ' ,'กิ่งอำเภอคลองเขื่อน'  );
        //AMP[7][1]= new Array('-1','77' ,'78' ,'79' ,'80' ,'81' ,'82' ,'83' ,'84' ,'85' ,'86' ,'87'  );

            #region Chonburi

            //AMP[8][0]=new Array('-- อำเภอ --','อำเภอเมืองชลบุรี' ,'อำเภอบ้านบึง' ,'อำเภอหนองใหญ่' ,'อำเภอบางละมุง' ,'อำเภอพานทอง' ,'อำเภอพนัสนิคม' ,'อำเภอศรีราชา' ,'อำเภอเกาะสีชัง' ,'อำเภอสัตหีบ' ,'อำเภอบ่อทอง' ,'กิ่งอำเภอเกาะจันทร์'  );
            //AMP[8][1]= new Array('-1','88' ,'89' ,'90' ,'91' ,'92' ,'93' ,'94' ,'95' ,'96' ,'97' ,'98'  );
            { 2001, 88 }, // เมืองชลบุรี
            { 2002, 89 }, // บ้านบึง
            { 2003, 90 }, // หนองใหญ่
            { 2004, 91 }, // บางละมุง
            { 2005, 92 }, // พานทอง
            { 2006, 93 }, // พนัสนิคม
            { 2007, 94 }, // ศรีราชา
            { 2008, 95 }, // เกาะสีชัง
            { 2009, 96 }, // สัตหีบ
            { 2010, 97 }, // บ่อทอง
            { 2011, 98 }, // เกาะจันทร์
            #endregion Chonburi

            #region Chainat

            //AMP[9][0]=new Array('-- อำเภอ --','อำเภอเมืองชัยนาท' ,'อำเภอมโนรมย์' ,'อำเภอวัดสิงห์' ,'อำเภอสรรพยา' ,'อำเภอสรรคบุรี' ,'อำเภอหันคา' ,'กิ่งอำเภอหนองมะโมง' ,'กิ่งอำเภอเนินขาม'  );
            //AMP[9][1]= new Array('-1','99' ,'100' ,'101' ,'102' ,'103' ,'104' ,'105' ,'106'  );
            { 1801, 99 }, // เมืองชัยนาท
            { 1802, 100 }, // มโนรมย์
            { 1803, 101 }, // วัดสิงห์
            { 1804, 102 }, // สรรพยา
            { 1805, 103 }, // สรรคบุรี
            { 1806, 104 }, // หันคา
            { 1807, 105 }, // หนองมะโมง
            { 1808, 106 }, // เนินขาม
            #endregion Chainat

            #region Chaiyaphum

            //AMP[10][0]=new Array('-- อำเภอ --','อำเภอเมืองชัยภูมิ' ,'อำเภอบ้านเขว้า' ,'อำเภอคอนสวรรค์' ,'อำเภอเกษตรสมบูรณ์' ,'อำเภอหนองบัวแดง' ,'อำเภอจัตุรัส' ,'อำเภอบำเหน็จณรงค์' ,'อำเภอหนองบัวระเหว' ,'อำเภอเทพสถิต' ,'อำเภอภูเขียว' ,'อำเภอบ้านแท่น' ,'อำเภอแก้งคร้อ' ,'อำเภอคอนสาร' ,'อำเภอภักดีชุมพล' ,'อำเภอเนินสง่า' ,'กิ่งอำเภอซับใหญ่'  );
            //AMP[10][1]= new Array('-1','107' ,'108' ,'109' ,'110' ,'111' ,'112' ,'113' ,'114' ,'115' ,'116' ,'117' ,'118' ,'119' ,'120' ,'121' ,'860'  );
            { 3601, 107 }, // เมืองชัยภูมิ
            { 3602, 108 }, // บ้านเขว้า
            { 3603, 109 }, // คอนสวรรค์
            { 3604, 110 }, // เกษตรสมบูรณ์
            { 3605, 111 }, // หนองบัวแดง
            { 3606, 112 }, // จัตุรัส
            { 3607, 113 }, // บำเหน็จณรงค์
            { 3608, 114 }, // หนองบัวระเหว
            { 3609, 115 }, // เทพสถิต
            { 3610, 116 }, // ภูเขียว
            { 3611, 117 }, // บ้านแท่น
            { 3612, 118 }, // แก้งคร้อ
            { 3613, 119 }, // คอนสาร
            { 3614, 120 }, // ภักดีชุมพล
            { 3615, 121 }, // เนินสง่า
            { 3616, 860 }, // ซับใหญ่
            #endregion Chaiyaphum

            #region Chumphon

            //AMP[11][0]=new Array('-- อำเภอ --','อำเภอเมืองชุมพร' ,'อำเภอพะโต๊ะ' ,'อำเภอสวี' ,'อำเภอทุ่งตะโก' ,'อำเภอละแม' ,'อำเภอท่าแซะ' ,'อำเภอปะทิว' ,'อำเภอหลังสวน'  );
            //AMP[11][1]= new Array('-1','122' ,'123' ,'124' ,'125' ,'126' ,'127' ,'128' ,'129'  );
            { 8601, 122 }, // เมืองชุมพร
            { 8602, 127 }, // ท่าแซะ
            { 8603, 128 }, // ปะทิว
            { 8604, 129 }, // หลังสวน
            { 8605, 126 }, // ละแม
            { 8606, 123 }, // พะโต๊ะ
            { 8607, 124 }, // สวี
            { 8608, 125 }, // ทุ่งตะโก
            #endregion Chumphon

        //AMP[12]=new Array(2);
        //AMP[12][0]=new Array('-- อำเภอ --','อำเภอเมืองเชียงราย' ,'อำเภอเวียงชัย' ,'อำเภอเชียงของ' ,'อำเภอเทิง' ,'อำเภอพาน' ,'อำเภอป่าแดด' ,'อำเภอแม่จัน' ,'อำเภอเชียงแสน' ,'อำเภอแม่สาย' ,'อำเภอแม่สรวย' ,'อำเภอเวียงป่าเป้า' ,'อำเภอพญาเม็งราย' ,'อำเภอเวียงแก่น' ,'อำเภอขุนตาล' ,'อำเภอแม่ฟ้าหลวง' ,'อำเภอแม่ลาว' ,'กิ่งอำเภอเวียงเชียงรุ้ง' ,'กิ่งอำเภอดอยหลวง'  );
        //AMP[12][1]= new Array('-1','130' ,'131' ,'132' ,'133' ,'134' ,'135' ,'136' ,'137' ,'138' ,'139' ,'140' ,'141' ,'142' ,'143' ,'144' ,'145' ,'835' ,'836'  );
        //AMP[13]=new Array(2);
        //AMP[13][0]=new Array('-- อำเภอ --','อำเภอเมืองเชียงใหม่' ,'อำเภอจอมทอง' ,'อำเภอแม่แจ่ม' ,'อำเภอเชียงดาว' ,'อำเภอดอยสะเก็ด' ,'อำเภอแม่แตง' ,'อำเภอแม่ริม' ,'อำเภอสะเมิง' ,'อำเภอฝาง' ,'อำเภอแม่อาย' ,'อำเภอพร้าว' ,'อำเภอสันป่าตอง' ,'อำเภอสันกำแพง' ,'อำเภอสันทราย' ,'อำเภอหางดง' ,'อำเภอฮอด' ,'อำเภอดอยเต่า' ,'อำเภออมก๋อย' ,'อำเภอสารภี' ,'อำเภอเวียงแหง' ,'อำเภอไชยปราการ' ,'อำเภอแม่วาง' ,'กิ่งอำเภอแม่ออน' ,'กิ่งอำเภอดอยหล่อ'  );
        //AMP[13][1]= new Array('-1','146' ,'147' ,'148' ,'149' ,'150' ,'151' ,'152' ,'153' ,'154' ,'155' ,'156' ,'157' ,'158' ,'159' ,'160' ,'161' ,'162' ,'163' ,'164' ,'165' ,'166' ,'167' ,'837' ,'838'  );

            #region Trang

            //AMP[14][0]=new Array('-- อำเภอ --','อำเภอเมืองตรัง' ,'อำเภอกันตัง' ,'อำเภอย่านตาขาว' ,'อำเภอปะเหลียน' ,'อำเภอสิเกา' ,'อำเภอห้วยยอด' ,'อำเภอวังวิเศษ' ,'อำเภอนาโยง' ,'อำเภอรัษฎา' ,'กิ่งอำเภอหาดสำราญ'  );
            //AMP[14][1]= new Array('-1','168' ,'169' ,'170' ,'171' ,'172' ,'173' ,'174' ,'175' ,'176' ,'177'  );
            { 9201, 168 }, // เมืองตรัง
            { 9202, 169 }, // กันตัง
            { 9203, 170 }, // ย่านตาขาว
            { 9204, 171 }, // ปะเหลียน
            { 9205, 172 }, // สิเกา
            { 9206, 173 }, // ห้วยยอด
            { 9207, 174 }, // วังวิเศษ
            { 9208, 175 }, // นาโยง
            { 9209, 176 }, // รัษฎา
            { 9210, 177 }, // หาดสำราญ
            #endregion Trang

            #region Trat

            //AMP[15][0]=new Array('-- อำเภอ --','อำเภอเมืองตราด' ,'อำเภอคลองใหญ่' ,'อำเภอเขาสมิง' ,'อำเภอบ่อไร่' ,'อำเภอแหลมงอบ' ,'กิ่งอำเภอเกาะกูด' ,'กิ่งอำเภอเกาะช้าง'  );
            //AMP[15][1]= new Array('-1','178' ,'179' ,'180' ,'181' ,'182' ,'183' ,'184'  );
            { 2301, 178 }, // เมืองตราด
            { 2302, 179 }, // คลองใหญ่
            { 2303, 180 }, // เขาสมิง
            { 2304, 181 }, // บ่อไร่
            { 2305, 182 }, // แหลมงอบ
            { 2306, 183 }, // เกาะกูด
            { 2307, 184 }, // เกาะช้าง
            #endregion Trat

            #region Tak

            //AMP[16][0]=new Array('-- อำเภอ --','อำเภอเมืองตาก' ,'อำเภอบ้านตาก' ,'อำเภอสามเงา' ,'อำเภอแม่ระมาด' ,'อำเภอท่าสองยาง' ,'อำเภอแม่สอด' ,'อำเภอพบพระ' ,'อำเภออุ้มผาง' ,'กิ่งอำเภอวังเจ้า'  );
            //AMP[16][1]= new Array('-1','185' ,'186' ,'187' ,'188' ,'189' ,'190' ,'191' ,'192' ,'839'  );
            { 6301, 185 }, // เมืองตาก
            { 6302, 186 }, // บ้านตาก
            { 6303, 187 }, // สามเงา
            { 6304, 188 }, // แม่ระมาด
            { 6305, 189 }, // ท่าสองยาง
            { 6306, 190 }, // แม่สอด
            { 6307, 191 }, // พบพระ
            { 6308, 192 }, // อุ้มผาง
            { 6309, 839 }, // วังเจ้า
            #endregion Tak

            #region Nakhon Nayok

            //AMP[17][0]=new Array('-- อำเภอ --','อำเภอเมืองนครนายก' ,'อำเภอปากพลี' ,'อำเภอบ้านนา' ,'อำเภอองครักษ์'  );
            //AMP[17][1]= new Array('-1','193' ,'194' ,'195' ,'196'  );
            { 2601, 193 }, // เมืองนครนายก
            { 2602, 194 }, // ปากพลี
            { 2603, 195 }, // บ้านนา
            { 2604, 196 }, // องครักษ์
            #endregion Nakhon Nayok

        //AMP[18]=new Array(2);
        //AMP[18][0]=new Array('-- อำเภอ --','อำเภอเมืองนครปฐม' ,'อำเภอบางเลน' ,'อำเภอสามพราน' ,'อำเภอพุทธมณฑล' ,'อำเภอกำแพงแสน' ,'อำเภอนครชัยศรี' ,'อำเภอดอนตูม'  );
        //AMP[18][1]= new Array('-1','197' ,'198' ,'199' ,'200' ,'201' ,'202' ,'203'  );
        //AMP[19]=new Array(2);
        //AMP[19][0]=new Array('-- อำเภอ --','อำเภอเมืองนครพนม' ,'อำเภอปลาปาก' ,'อำเภอท่าอุเทน' ,'อำเภอบ้านแพง' ,'อำเภอธาตุพนม' ,'อำเภอเรณูนคร' ,'อำเภอนาแก' ,'อำเภอศรีสงคราม' ,'อำเภอนาหว้า' ,'อำเภอโพนสวรรค์' ,'อำเภอนาทม' ,'กิ่งอำเภอวังยาง'  );
        //AMP[19][1]= new Array('-1','204' ,'205' ,'206' ,'207' ,'208' ,'209' ,'210' ,'211' ,'212' ,'213' ,'214' ,'861'  );
        //AMP[20]=new Array(2);
        //AMP[20][0]=new Array('-- อำเภอ --','อำเภอเมืองนครราชสีมา' ,'อำเภอครบุรี' ,'อำเภอเสิงสาง' ,'อำเภอคง' ,'อำเภอบ้านเหลื่อม' ,'อำเภอจักราช' ,'อำเภอโชคชัย' ,'อำเภอด่านขุนทด' ,'อำเภอโนนไทย' ,'อำเภอโนนสูง' ,'อำเภอขามสะแกแสง' ,'อำเภอบัวใหญ่' ,'อำเภอประทาย' ,'อำเภอปักธงชัย' ,'อำเภอพิมาย' ,'อำเภอห้วยแถลง' ,'อำเภอชุมพวง' ,'อำเภอสูงเนิน' ,'อำเภอขามทะเลสอ' ,'อำเภอสีคิ้ว' ,'อำเภอปากช่อง' ,'อำเภอหนองบุญนาก' ,'อำเภอแก้งสนามนาง' ,'อำเภอโนนแดง' ,'อำเภอวังน้ำเขียว' ,'อำเภอเฉลิมพระเกียรติ' ,'กิ่งอำเภอเมืองยาง' ,'กิ่งอำเภอบัวลาย' ,'กิ่งอำเภอสีดา' ,'กิ่งอำเภอเทพารักษ์' ,'กิ่งอำเภอพระทองคำ' ,'กิ่งอำเภอลำทะเมนชัย'  );
        //AMP[20][1]= new Array('-1','215' ,'216' ,'217' ,'218' ,'219' ,'220' ,'221' ,'222' ,'223' ,'224' ,'225' ,'226' ,'227' ,'228' ,'229' ,'230' ,'231' ,'232' ,'233' ,'234' ,'235' ,'236' ,'237' ,'238' ,'239' ,'240' ,'862' ,'863' ,'864' ,'865' ,'866' ,'867'  );
        //AMP[21]=new Array(2);
        //AMP[21][0]=new Array('-- อำเภอ --','อำเภอเมืองนครศรีธรรมราช' ,'อำเภอพรหมคีรี' ,'อำเภอลานสกา' ,'อำเภอฉวาง' ,'อำเภอพิปูน' ,'อำเภอเชียรใหญ่' ,'อำเภอชะอวด' ,'อำเภอท่าศาลา' ,'อำเภอทุ่งสง' ,'อำเภอนาบอน' ,'อำเภอทุ่งใหญ่' ,'อำเภอปากพนัง' ,'อำเภอร่อนพิบูลย์' ,'อำเภอสิชล' ,'อำเภอหัวไทร' ,'อำเภอขนอม' ,'อำเภอบางขัน' ,'อำเภอจุฬาภรณ์' ,'อำเภอถ้ำพรรณรา' ,'อำเภอเฉลิมพระเกียรติ' ,'อำเภอพระพรหม' ,'กิ่งอำเภอนบพิตำ' ,'กิ่งอำเภอช้างกลาง'  );
        //AMP[21][1]= new Array('-1','241' ,'242' ,'243' ,'244' ,'245' ,'246' ,'247' ,'248' ,'249' ,'250' ,'251' ,'252' ,'253' ,'254' ,'255' ,'256' ,'257' ,'258' ,'259' ,'260' ,'261' ,'262' ,'263'  );
        //AMP[22]=new Array(2);
        //AMP[22][0]=new Array('-- อำเภอ --','อำเภอเมืองนครสวรรค์' ,'อำเภอโกรกพระ' ,'อำเภอชุมแสง' ,'อำเภอหนองบัว' ,'อำเภอบรรพรตพิสัย' ,'อำเภอตาคลี' ,'อำเภอท่าตะโก' ,'อำเภอพยุหะคีรี' ,'อำเภอลาดยาว' ,'อำเภอไพศาลี' ,'อำเภอตากฟ้า' ,'อำเภอเก้าเลี้ยว' ,'อำเภอแม่วงก์' ,'กิ่งอำเภอชุมตาบง' ,'กิ่งอำเภอแม่เปิน'  );
        //AMP[22][1]= new Array('-1','264' ,'265' ,'266' ,'267' ,'268' ,'269' ,'270' ,'271' ,'272' ,'273' ,'274' ,'275' ,'276' ,'840' ,'841'  );

            #region Nonthaburi

            //AMP[23][0]=new Array('-- อำเภอ --','อำเภอเมืองนนทบุรี' ,'อำเภอบางกรวย' ,'อำเภอบางใหญ่' ,'อำเภอบางบัวทอง' ,'อำเภอไทรน้อย' ,'อำเภอปากเกร็ด'  );
            //AMP[23][1]= new Array('-1','277' ,'278' ,'279' ,'280' ,'281' ,'282'  );
            { 1201, 277 }, // เมืองนนทบุรี
            { 1202, 278 }, // บางกรวย
            { 1203, 279 }, // บางใหญ่
            { 1204, 280 }, // บางบัวทอง
            { 1205, 281 }, // ไทรน้อย
            { 1206, 282 }, // ปากเกร็ด
            #endregion Nonthaburi

        //AMP[24]=new Array(2);
        //AMP[24][0]=new Array('-- อำเภอ --','อำเภอเมืองนราธิวาส' ,'อำเภอตากใบ' ,'อำเภอบาเจาะ' ,'อำเภอยี่งอ' ,'อำเภอระแงะ' ,'อำเภอรือเสาะ' ,'อำเภอศรีสาคร' ,'อำเภอแว้ง' ,'อำเภอสุคิริน' ,'อำเภอสุไหงโก-ลก' ,'อำเภอสุไหงปาดี' ,'อำเภอจะแนะ' ,'อำเภอเจาะไอร้อง'  );
        //AMP[24][1]= new Array('-1','283' ,'284' ,'285' ,'286' ,'287' ,'288' ,'289' ,'290' ,'291' ,'292' ,'293' ,'294' ,'295'  );
        //AMP[25]=new Array(2);
        //AMP[25][0]=new Array('-- อำเภอ --','อำเภอเมืองน่าน' ,'อำเภอแม่จริม' ,'อำเภอบ้านหลวง' ,'อำเภอนาน้อย' ,'อำเภอปัว' ,'อำเภอท่าวังผา' ,'อำเภอทุ่งช้าง' ,'อำเภอเชียงกลาง' ,'อำเภอนาหมื่น' ,'อำเภอสันติสุข' ,'อำเภอบ่อเกลือ' ,'อำเภอสองแคว' ,'อำเภอเฉลิมพระเกียรติ' ,'อำเภอเวียงสา' ,'กิ่งอำเภอภูเพียง'  );
        //AMP[25][1]= new Array('-1','296' ,'297' ,'298' ,'299' ,'300' ,'301' ,'302' ,'303' ,'304' ,'305' ,'306' ,'307' ,'308' ,'842' ,'849'  );
        //AMP[26]=new Array(2);
        //AMP[26][0]=new Array('-- อำเภอ --','อำเภอเมืองบุรีรัมย์' ,'อำเภอชำนิ' ,'อำเภอบ้านใหม่ไชยพจน์' ,'อำเภอโนนดินแดง' ,'อำเภอเฉลิมพระเกียรติ' ,'อำเภอโนนสุวรรณ' ,'อำเภอคูเมือง' ,'อำเภอกระสัง' ,'อำเภอนางรอง' ,'อำเภอหนองกี่' ,'อำเภอละหานทราย' ,'อำเภอประโคนชัย' ,'อำเภอบ้านกรวด' ,'อำเภอพุทไธสง' ,'อำเภอลำปลายมาศ' ,'อำเภอสตึก' ,'อำเภอปะคำ' ,'อำเภอนาโพธิ์' ,'อำเภอหนองหงส์' ,'อำเภอพลับพลาชัย' ,'อำเภอห้วยราช' ,'กิ่งอำเภอบ้านด่าน' ,'กิ่งอำเภอแดนดง'  );
        //AMP[26][1]= new Array('-1','309' ,'310' ,'311' ,'312' ,'313' ,'314' ,'315' ,'316' ,'317' ,'318' ,'319' ,'320' ,'321' ,'322' ,'323' ,'324' ,'325' ,'326' ,'327' ,'328' ,'329' ,'868' ,'869'  );

            #region Pathum Thani

            //AMP[27][0]=new Array('-- อำเภอ --','อำเภอเมืองปทุมธานี' ,'อำเภอคลองหลวง' ,'อำเภอธัญบุรี' ,'อำเภอหนองเสือ' ,'อำเภอลาดหลุมแก้ว' ,'อำเภอลำลูกกา' ,'อำเภอสามโคก'  );
            //AMP[27][1]= new Array('-1','330' ,'331' ,'332' ,'333' ,'334' ,'335' ,'336'  );
            { 1301, 330 }, // เมืองปทุมธานี
            { 1302, 331 }, // คลองหลวง
            { 1303, 332 }, // ธัญบุรี
            { 1304, 333 }, // หนองเสือ
            { 1305, 334 }, // ลาดหลุมแก้ว
            { 1306, 335 }, // ลำลูกกา
            { 1307, 336 }, // สามโคก
            #endregion Pathum Thani

        //AMP[28][0]=new Array('-- อำเภอ --','อำเภอเมืองประจวบคีรีขันธ์' ,'อำเภอกุยบุรี' ,'อำเภอทับสะแก' ,'อำเภอบางสะพาน' ,'อำเภอบางสะพานน้อย' ,'อำเภอปราณบุรี' ,'อำเภอหัวหิน' ,'อำเภอสามร้อยยอด'  );
        //AMP[28][1]= new Array('-1','337' ,'338' ,'339' ,'340' ,'341' ,'342' ,'343' ,'344'  );
        //AMP[29]=new Array(2);
        //AMP[29][0]=new Array('-- อำเภอ --','อำเภอเมืองปราจีนบุรี' ,'อำเภอกบินทร์บุรี' ,'อำเภอนาดี' ,'อำเภอบ้านสร้าง' ,'อำเภอประจันตคาม' ,'อำเภอศรีมหาโพธิ' ,'อำเภอศรีมโหสถ'  );
        //AMP[29][1]= new Array('-1','345' ,'346' ,'347' ,'348' ,'349' ,'350' ,'351'  );
        //AMP[30]=new Array(2);
        //AMP[30][0]=new Array('-- อำเภอ --','อำเภอเมืองปัตตานี' ,'อำเภอโคกโพธิ์' ,'อำเภอหนองจิก' ,'อำเภอปานาเระ' ,'อำเภอมายอ' ,'อำเภอทุ่งยางแดง' ,'อำเภอสายบุรี' ,'อำเภอไม้แก่น' ,'อำเภอยะหริ่ง' ,'อำเภอยะรัง' ,'อำเภอกะพ้อ' ,'อำเภอแม่ลาน'  );
        //AMP[30][1]= new Array('-1','352' ,'353' ,'354' ,'355' ,'356' ,'357' ,'358' ,'359' ,'360' ,'361' ,'362' ,'363'  );
        //AMP[31]=new Array(2);
        //AMP[31][0]=new Array('-- อำเภอ --','อำเภอพระนครศรีอยุธยา' ,'อำเภอท่าเรือ' ,'อำเภอนครหลวง' ,'อำเภอบางไทร' ,'อำเภอบางบาล' ,'อำเภอบางปะอิน' ,'อำเภอบางปะหัน' ,'อำเภอผักไห่' ,'อำเภอภาชี' ,'อำเภอลาดบัวหลวง' ,'อำเภอวังน้อย' ,'อำเภอเสนา' ,'อำเภอบางซ้าย' ,'อำเภออุทัย' ,'อำเภอมหาราช' ,'อำเภอบ้านแพรก'  );
        //AMP[31][1]= new Array('-1','364' ,'365' ,'366' ,'367' ,'368' ,'369' ,'370' ,'371' ,'372' ,'373' ,'374' ,'375' ,'376' ,'377' ,'378' ,'379'  );
        //AMP[32]=new Array(2);
        //AMP[32][0]=new Array('-- อำเภอ --','อำเภอเมืองพะเยา' ,'อำเภอจุน' ,'อำเภอเชียงคำ' ,'อำเภอเชียงม่วน' ,'อำเภอดอกคำใต้' ,'อำเภอปง' ,'อำเภอแม่ใจ' ,'กิ่งอำเภอภูกามยาว' ,'กิ่งอำเภอภูซาง'  );
        //AMP[32][1]= new Array('-1','380' ,'381' ,'382' ,'383' ,'384' ,'385' ,'386' ,'843' ,'844'  );
        //AMP[33]=new Array(2);
        //AMP[33][0]=new Array('-- อำเภอ --','อำเภอเมืองพังงา' ,'อำเภอกะปง' ,'อำเภอตะกั่วทุ่ง' ,'อำเภอตะกั่วป่า' ,'อำเภอคุระบุรี' ,'อำเภอทับปุด' ,'อำเภอท้ายเหมือง' ,'อำเภอเกาะยาว'  );
        //AMP[33][1]= new Array('-1','387' ,'388' ,'389' ,'390' ,'391' ,'392' ,'393' ,'394'  );
        //AMP[34]=new Array(2);
        //AMP[34][0]=new Array('-- อำเภอ --','อำเภอเมืองพัทลุง' ,'อำเภอกงหรา' ,'อำเภอเขาชัยสน' ,'อำเภอตะโหมด' ,'อำเภอควนขนุน' ,'อำเภอปากพะยูน' ,'อำเภอศรีบรรพต' ,'อำเภอป่าบอน' ,'อำเภอบางแก้ว' ,'อำเภอป่าพะยอม' ,'กิ่งอำเภอศรีนครินทร์ (เมือง)'  );
        //AMP[34][1]= new Array('-1','395' ,'396' ,'397' ,'398' ,'399' ,'400' ,'401' ,'402' ,'403' ,'404' ,'405'  );
        //AMP[35]=new Array(2);
        //AMP[35][0]=new Array('-- อำเภอ --','อำเภอเมืองพิจิตร' ,'อำเภอโพธิ์ประทับช้าง' ,'อำเภอตะพานหิน' ,'อำเภอบางมูลนาก' ,'อำเภอวังทรายพูน' ,'อำเภอโพทะเล' ,'อำเภอสามง่าม' ,'อำเภอทับคล้อ' ,'อำเภอวชิรบารมี' ,'กิ่งอำเภอดงเจริญ' ,'กิ่งอำเภอบึงนาราง' ,'กิ่งอำเภอสากเหล็ก'  );
        //AMP[35][1]= new Array('-1','406' ,'407' ,'408' ,'409' ,'410' ,'411' ,'412' ,'413' ,'845' ,'846' ,'847' ,'850'  );
        //AMP[36]=new Array(2);
        //AMP[36][0]=new Array('-- อำเภอ --','อำเภอเมืองพิษณุโลก' ,'อำเภอนครไทย' ,'อำเภอชาติตระการ' ,'อำเภอบางระกำ' ,'อำเภอบางกระทุ่ม' ,'อำเภอพรหมพิราม' ,'อำเภอวัดโบสถ์' ,'อำเภอวังทอง' ,'อำเภอเนินมะปราง'  );
        //AMP[36][1]= new Array('-1','414' ,'415' ,'416' ,'417' ,'418' ,'419' ,'420' ,'421' ,'422'  );
        //AMP[37]=new Array(2);
        //AMP[37][0]=new Array('-- อำเภอ --','อำเภอเมืองเพชรบุรี' ,'อำเภอเขาย้อย' ,'อำเภอหนองหญ้าปล้อง' ,'อำเภอชะอำ' ,'อำเภอท่ายาง' ,'อำเภอบ้านลาด' ,'อำเภอบ้านแหลม' ,'อำเภอแก่งกระจาน'  );
        //AMP[37][1]= new Array('-1','423' ,'424' ,'425' ,'426' ,'427' ,'428' ,'429' ,'430'  );
        //AMP[38]=new Array(2);
        //AMP[38][0]=new Array('-- อำเภอ --','อำเภอเมืองเพชรบูรณ์' ,'อำเภอชนแดน' ,'อำเภอหล่มสัก' ,'อำเภอหล่มเก่า' ,'อำเภอวิเชียรบุรี' ,'อำเภอศรีเทพ' ,'อำเภอหนองไผ่' ,'อำเภอบึงสามพัน' ,'อำเภอน้ำหนาว' ,'อำเภอวังโป่ง' ,'อำเภอเขาค้อ'  );
        //AMP[38][1]= new Array('-1','431' ,'432' ,'433' ,'434' ,'435' ,'436' ,'437' ,'438' ,'439' ,'440' ,'441'  );

            #region Phrae

            //AMP[39][0]=new Array('-- อำเภอ --','อำเภอเมืองแพร่' ,'อำเภอร้องกวาง' ,'อำเภอลอง' ,'อำเภอหนองม่วงไข่' ,'อำเภอสูงเม่น' ,'อำเภอเด่นชัย' ,'อำเภอสอง' ,'อำเภอวังชิ้น'  );
            //AMP[39][1]= new Array('-1','442' ,'443' ,'444' ,'445' ,'446' ,'447' ,'448' ,'449'  );
            { 5401, 442 }, // เมืองแพร่
            { 5402, 443 }, // ร้องกวาง
            { 5403, 444 }, // ลอง
            { 5404, 446 }, // สูงเม่น
            { 5405, 447 }, // เด่นชัย
            { 5406, 448 }, // สอง
            { 5407, 449 }, // วังชิ้น
            { 5408, 445 }, // หนองม่วงไข่
            #endregion Phrae

            #region Phuket

            //AMP[40][0]=new Array('-- อำเภอ --','อำเภอเมืองภูเก็ต' ,'อำเภอกะทู้' ,'อำเภอถลาง'  );
            //AMP[40][1]= new Array('-1','450' ,'451' ,'452'  );
            { 8301, 450 }, // เมืองภูเก็ต
            { 8302, 451 }, // กะทู้
            { 8303, 452 }, // ถลาง
            #endregion Phuket

            #region Maha Sarakham

            //AMP[41][0]=new Array('-- อำเภอ --','อำเภอเมืองมหาสารคาม' ,'อำเภอแกดำ' ,'อำเภอโกสุมพิสัย' ,'อำเภอกันทรวิชัย' ,'อำเภอเชียงยืน' ,'อำเภอบรบือ' ,'อำเภอนาเชือก' ,'อำเภอพยัคฆภูมิพิสัย' ,'อำเภอวาปีปทุม' ,'อำเภอนาดูน' ,'อำเภอยางสีสุราช' ,'กิ่งอำเภอกุดรัง' ,'กิ่งอำเภอชื่นชม'  );
            //AMP[41][1]= new Array('-1','453' ,'454' ,'455' ,'456' ,'457' ,'458' ,'459' ,'460' ,'461' ,'462' ,'463' ,'870' ,'871'  );
            { 4401, 453 }, // เมืองมหาสารคาม
            { 4402, 454 }, // แกดำ
            { 4403, 455 }, // โกสุมพิสัย
            { 4404, 456 }, // กันทรวิชัย
            { 4405, 457 }, // เชียงยืน
            { 4406, 458 }, // บรบือ
            { 4407, 459 }, // นาเชือก
            { 4408, 460 }, // พยัคฆภูมิพิสัย
            { 4409, 461 }, // วาปีปทุม
            { 4410, 462 }, // นาดูน
            { 4411, 463 }, // ยางสีสุราช
            { 4412, 870 }, // กุดรัง
            { 4413, 871 }, // ชื่นชม
            #endregion Maha Sarakham

            #region Mukdahan

            //AMP[42][0]=new Array('-- อำเภอ --','อำเภอเมืองมุกดาหาร' ,'อำเภอนิคมคำสร้อย' ,'อำเภอดอนตาล' ,'อำเภอดงหลวง' ,'อำเภอคำชะอี' ,'อำเภอหว้านใหญ่' ,'อำเภอหนองสูง'  );
            //AMP[42][1]= new Array('-1','464' ,'465' ,'466' ,'467' ,'468' ,'469' ,'470'  );
            { 4901, 464 }, // เมืองมุกดาหาร
            { 4902, 465 }, // นิคมคำสร้อย
            { 4903, 466 }, // ดอนตาล
            { 4904, 467 }, // ดงหลวง
            { 4905, 468 }, // คำชะอี
            { 4906, 469 }, // หว้านใหญ่
            { 4907, 470 }, // หนองสูง
            #endregion Mukdahan

            #region Mae Hong Son

            //AMP[43][0]=new Array('-- อำเภอ --','อำเภอเมืองแม่ฮ่องสอน' ,'อำเภอขุนยวม' ,'อำเภอปาย' ,'อำเภอแม่สะเรียง' ,'อำเภอแม่ลาน้อย' ,'อำเภอสบเมย' ,'อำเภอปางมะผ้า'  );
            //AMP[43][1]= new Array('-1','471' ,'472' ,'473' ,'474' ,'475' ,'476' ,'477'  );
            { 5801, 471 }, // เมืองแม่ฮ่องสอน
            { 5802, 472 }, // ขุนยวม
            { 5803, 473 }, // ปาย
            { 5804, 474 }, // แม่สะเรียง
            { 5805, 475 }, // แม่ลาน้อย
            { 5806, 476 }, // สบเมย
            { 5807, 477 }, // ปางมะผ้า
            #endregion Mae Hong Son

            #region Yasothon

            //AMP[44][0]=new Array('-- อำเภอ --','อำเภอเมืองยโสธร' ,'อำเภอทรายมูล' ,'อำเภอกุดชุม' ,'อำเภอคำเขื่อนแก้ว' ,'อำเภอป่าติ้ว' ,'อำเภอมหาชนะชัย' ,'อำเภอค้อวัง' ,'อำเภอเลิงนกทา' ,'อำเภอไทยเจริญ'  );
            //AMP[44][1]= new Array('-1','478' ,'479' ,'480' ,'481' ,'482' ,'483' ,'484' ,'485' ,'486'  );
            { 3501, 478 }, // เมืองยโสธร
            { 3502, 479 }, // ทรายมูล
            { 3503, 480 }, // กุดชุม
            { 3504, 481 }, // คำเขื่อนแก้ว
            { 3505, 482 }, // ป่าติ้ว
            { 3506, 483 }, // มหาชนะชัย
            { 3507, 484 }, // ค้อวัง
            { 3508, 485 }, // เลิงนกทา
            { 3509, 486 }, // ไทยเจริญ
            #endregion Yasothon

            #region Yala

            //AMP[45][0]=new Array('-- อำเภอ --','อำเภอเมืองยะลา' ,'อำเภอเบตง' ,'อำเภอบันนังสตา' ,'อำเภอธารโต' ,'อำเภอยะหา' ,'อำเภอรามัน' ,'อำเภอกรงปีนัง' ,'อำเภอกาบัง'  );
            //AMP[45][1]= new Array('-1','487' ,'488' ,'489' ,'490' ,'491' ,'492' ,'493' ,'494'  );
            { 9501, 487 }, // เมืองยะลา
            { 9502, 488 }, // เบตง
            { 9503, 489 }, // บันนังสตา
            { 9504, 490 }, // ธารโต
            { 9505, 491 }, // ยะหา
            { 9506, 492 }, // รามัน
            { 9507, 494 }, // กาบัง
            { 9508, 493 }, // กรงปินัง
            #endregion Yala

        //AMP[46]=new Array(2);
        //AMP[46][0]=new Array('-- อำเภอ --','อำเภอเมืองร้อยเอ็ด' ,'อำเภอจตุรพักตรพิมาน' ,'อำเภอธวัชบุรี' ,'อำเภอพนมไพร' ,'อำเภอโพนทอง' ,'อำเภอโพธิ์ชัย' ,'อำเภอหนองพอก' ,'อำเภอเสลภูมิ' ,'อำเภอสุวรรณภูมิ' ,'อำเภอเมืองสรวง' ,'อำเภอโพนทราย' ,'อำเภออาจสามารถ' ,'อำเภอเมยวดี' ,'อำเภอศรีสมเด็จ' ,'อำเภอจังหาร' ,'อำเภอปทุมรัตต์' ,'อำเภอเกษตรวิสัย' ,'กิ่งอำเภอเชียงขวัญ' ,'กิ่งอำเภอหนองฮี' ,'กิ่งอำเภอทุ่งเขาหลวง'  );
        //AMP[46][1]= new Array('-1','495' ,'496' ,'497' ,'498' ,'499' ,'500' ,'501' ,'502' ,'503' ,'504' ,'505' ,'506' ,'507' ,'508' ,'509' ,'510' ,'511' ,'872' ,'873' ,'874'  );

            #region Ranong

            //AMP[47][0]=new Array('-- อำเภอ --','อำเภอเมืองระนอง' ,'อำเภอละอุ่น' ,'อำเภอกะเปอร์' ,'อำเภอกระบุรี' ,'กิ่งอำเภอสุขสำราญ  (กะเปอร์)'  );
            //AMP[47][1]= new Array('-1','512' ,'513' ,'514' ,'515' ,'516'  );
            { 8501, 512 }, // เมืองระนอง
            { 8502, 513 }, // ละอุ่น
            { 8503, 514 }, // กะเปอร์
            { 8504, 515 }, // กระบุรี
            { 8505, 516 }, // สุขสำราญ

            #endregion Ranong

            #region Rayong

            //AMP[48][0]=new Array('-- อำเภอ --','อำเภอเมืองระยอง' ,'อำเภอบ้านค่าย' ,'อำเภอปลวกแดง' ,'อำเภอเขาชะเมา' ,'อำเภอนิคมพัฒนา' ,'อำเภอแกลง' ,'อำเภอบ้านฉาง' ,'อำเภอวังจันทร์'  );
            //AMP[48][1]= new Array('-1','517' ,'518' ,'519' ,'520' ,'521' ,'522' ,'523' ,'524'  );
            { 2101, 517 }, // เมืองระยอง
            { 2102, 523 }, // บ้านฉาง
            { 2103, 522 }, // แกลง
            { 2104, 524 }, // วังจันทร์
            { 2105, 518 }, // บ้านค่าย
            { 2106, 519 }, // ปลวกแดง
            { 2107, 520 }, // เขาชะเมา
            { 2108, 521 }, // นิคมพัฒนา
            #endregion Rayong

        //AMP[49]=new Array(2);
        //AMP[49][0]=new Array('-- อำเภอ --','อำเภอเมืองราชบุรี' ,'อำเภอจอมบึง' ,'อำเภอสวนผึ้ง' ,'อำเภอดำเนินสะดวก' ,'อำเภอบ้านโป่ง' ,'อำเภอบางแพ' ,'อำเภอโพธาราม' ,'อำเภอปากท่อ' ,'อำเภอวัดเพลง' ,'อำเภอบ้านคา'  );
        //AMP[49][1]= new Array('-1','525' ,'526' ,'527' ,'528' ,'529' ,'530' ,'531' ,'532' ,'533' ,'534'  );
        //AMP[50]=new Array(2);
        //AMP[50][0]=new Array('-- อำเภอ --','อำเภอเมืองลพบุรี' ,'อำเภอพัฒนานิคม' ,'อำเภอโคกสำโรง' ,'อำเภอหนองม่วง' ,'อำเภอสระโบสถ์' ,'อำเภอโคกเจริญ' ,'อำเภอชัยบาดาล' ,'อำเภอลำสนธิ' ,'อำเภอท่าหลวง' ,'อำเภอท่าวุ้ง' ,'อำเภอบ้านหมี่'  );
        //AMP[50][1]= new Array('-1','535' ,'536' ,'537' ,'538' ,'539' ,'540' ,'541' ,'542' ,'543' ,'544' ,'545'  );

            #region Lampang

            //AMP[51][0]=new Array('-- อำเภอ --','อำเภอเมืองลำปาง' ,'อำเภอแม่เมาะ' ,'อำเภอเกาะคา' ,'อำเภอเสริมงาม' ,'อำเภองาว' ,'อำเภอแจ้ห่ม' ,'อำเภอวังเหนือ' ,'อำเภอเถิน' ,'อำเภอแม่พริก' ,'อำเภอแม่ทะ' ,'อำเภอสบปราบ' ,'อำเภอห้างฉัตร' ,'อำเภอเมืองปาน'  );
            //AMP[51][1]= new Array('-1','546' ,'547' ,'548' ,'549' ,'550' ,'551' ,'552' ,'553' ,'554' ,'555' ,'556' ,'557' ,'558'  );
            { 5201, 546 }, // เมืองลำปาง
            { 5202, 547 }, // แม่เมาะ
            { 5203, 548 }, // เกาะคา
            { 5204, 549 }, // เสริมงาม
            { 5205, 550 }, // งาว
            { 5206, 551 }, // แจ้ห่ม
            { 5207, 552 }, // วังเหนือ
            { 5208, 553 }, // เถิน
            { 5209, 554 }, // แม่พริก
            { 5210, 555 }, // แม่ทะ
            { 5211, 556 }, // สบปราบ
            { 5212, 557 }, // ห้างฉัตร
            { 5213, 558 }, // เมืองปาน
            #endregion Lampang

            #region Lamphun

            //AMP[52][0]=new Array('-- อำเภอ --','อำเภอเมืองลำพูน' ,'อำเภอทุ่งหัวช้าง' ,'อำเภอป่าซาง' ,'อำเภอบ้านธิ' ,'อำเภอลี้' ,'อำเภอแม่ทา' ,'อำเภอบ้านโฮ่ง' ,'กิ่งอำเภอเวียงหนองล่อง'  );
            //AMP[52][1]= new Array('-1','559' ,'560' ,'561' ,'562' ,'563' ,'564' ,'565' ,'848'  );
            { 5101, 559 }, // เมืองลำพูน
            { 5102, 564 }, // แม่ทา
            { 5103, 565 }, // บ้านโฮ่ง
            { 5104, 563 }, // ลี้
            { 5105, 560 }, // ทุ่งหัวช้าง
            { 5106, 561 }, // ป่าซาง
            { 5107, 562 }, // บ้านธิ
            { 5108, 848 }, // เวียงหนองล่อง
            #endregion Lamphun

        //AMP[53]=new Array(2);
        //AMP[53][0]=new Array('-- อำเภอ --','อำเภอเมืองเลย' ,'อำเภอนาด้วง' ,'อำเภอเชียงคาน' ,'อำเภอปากชม' ,'อำเภอด่านซ้าย' ,'อำเภอนาแห้ว' ,'อำเภอภูเรือ' ,'อำเภอท่าลี่' ,'อำเภอวังสะพุง' ,'อำเภอภูกระดึง' ,'อำเภอภูหลวง' ,'อำเภอผาขาว' ,'กิ่งอำเภอเอราวัณ' ,'กิ่งอำเภอหนองหิน'  );
        //AMP[53][1]= new Array('-1','566' ,'567' ,'568' ,'569' ,'570' ,'571' ,'572' ,'573' ,'574' ,'575' ,'576' ,'577' ,'875' ,'876'  );
        //AMP[54]=new Array(2);
        //AMP[54][0]=new Array('-- อำเภอ --','อำเภอเมืองศรีสะเกษ' ,'อำเภอยางชุมน้อย' ,'อำเภอกันทรารมย์' ,'อำเภอกันทราลักษ์' ,'อำเภอขุขันธ์' ,'อำเภอไพรบึง' ,'อำเภอปรางค์กู่' ,'อำเภอขุนหาญ' ,'อำเภอราศีไศล' ,'อำเภออุทุมพรพิสัย' ,'อำเภอบึงบูรพ์' ,'อำเภอห้วยทับทัน' ,'อำเภอโนนคูน' ,'อำเภอศรีรัตนะ' ,'อำเภอน้ำเกลี้ยง' ,'อำเภอวังหิน' ,'อำเภอภูสิงห์' ,'อำเภอเมืองจันทร์' ,'อำเภอเบญจลักษณ์' ,'อำเภอพยุห์' ,'กิ่งอำเภอโพธิ์ศรีสุวรรณ' ,'กิ่งอำเภอศิลาลาด'  );
        //AMP[54][1]= new Array('-1','578' ,'579' ,'580' ,'581' ,'582' ,'583' ,'584' ,'585' ,'586' ,'587' ,'588' ,'589' ,'590' ,'591' ,'592' ,'593' ,'594' ,'595' ,'596' ,'597' ,'877' ,'878'  );
        //AMP[55]=new Array(2);
        //AMP[55][0]=new Array('-- อำเภอ --','อำเภอเมืองสกลนคร' ,'อำเภอกุสุมาลย์' ,'อำเภอกุดบาก' ,'อำเภอพรรณนานิคม' ,'อำเภอพังโคน' ,'อำเภอวาริชภูมิ' ,'อำเภอนิคมน้ำอูน' ,'อำเภอวานรนิวาส' ,'อำเภอคำตากล้า' ,'อำเภอบ้านม่วง' ,'อำเภออากาศอำนวย' ,'อำเภอสว่างแดนดิน' ,'อำเภอส่องดาว' ,'อำเภอเต่างอย' ,'อำเภอโคกศรีสุพรรณ' ,'อำเภอเจริญศิลป์' ,'อำเภอโพนนาแก้ว' ,'อำเภอภูพาน'  );
        //AMP[55][1]= new Array('-1','598' ,'599' ,'600' ,'601' ,'602' ,'603' ,'604' ,'605' ,'606' ,'607' ,'608' ,'609' ,'610' ,'611' ,'612' ,'613' ,'614' ,'615'  );

            #region Songkhla

            //AMP[56][0]=new Array('-- อำเภอ --','อำเภอเมืองสงขลา' ,'อำเภอสทิงพระ' ,'อำเภอจะนะ' ,'อำเภอนาทวี' ,'อำเภอเทพา' ,'อำเภอสะบ้าย้อย' ,'อำเภอระโนด' ,'อำเภอกระแสสินธ์' ,'อำเภอรัตภูมิ' ,'อำเภอสะเดา' ,'อำเภอหาดใหญ่' ,'อำเภอนาหม่อม' ,'อำเภอควนเนียง' ,'อำเภอบางกล่ำ' ,'อำเภอสิงหนคร' ,'อำเภอคลองหอยโข่ง'  );
            //AMP[56][1]= new Array('-1','616' ,'617' ,'618' ,'619' ,'620' ,'621' ,'622' ,'623' ,'624' ,'625' ,'626' ,'627' ,'628' ,'629' ,'630' ,'631'  );
            { 9001, 616 }, // เมืองสงขลา
            { 9002, 617 }, // สทิงพระ
            { 9003, 618 }, // จะนะ
            { 9004, 619 }, // นาทวี
            { 9005, 620 }, // เทพา
            { 9006, 621 }, // สะบ้าย้อย
            { 9007, 622 }, // ระโนด
            { 9008, 623 }, // กระแสสินธุ์
            { 9009, 624 }, // รัตภูมิ
            { 9010, 625 }, // สะเดา
            { 9011, 626 }, // หาดใหญ่
            { 9012, 627 }, // นาหม่อม
            { 9013, 628 }, // ควนเนียง
            { 9014, 629 }, // บางกล่ำ
            { 9015, 630 }, // สิงหนคร
            { 9016, 631 }, // คลองหอยโข่ง
            #endregion Songkhla

            #region Satun

            //AMP[57][0]=new Array('-- อำเภอ --','อำเภอเมืองสตูล' ,'อำเภอควนโดน' ,'อำเภอควนกาหลง' ,'อำเภอท่าแพ' ,'อำเภอละงู' ,'อำเภอทุ่งหว้า' ,'กิ่งอำเภอมะนัง (ควนกาหลง)'  );
            //AMP[57][1]= new Array('-1','632' ,'633' ,'634' ,'635' ,'636' ,'637' ,'638'  );
            { 9101, 632 }, // เมืองสตูล
            { 9102, 633 }, // ควนโดน
            { 9103, 634 }, // ควนกาหลง
            { 9104, 635 }, // ท่าแพ
            { 9105, 636 }, // ละงู
            { 9106, 637 }, // ทุ่งหว้า
            { 9107, 638 }, // มะนัง
            #endregion Satun

            #region Samut Prakan

            //AMP[58][0]=new Array('-- อำเภอ --','อำเภอเมืองสมุทรปราการ' ,'อำเภอบางบ่อ' ,'อำเภอบางพลี' ,'อำเภอพระประแดง' ,'อำเภอพระสมุทรเจดีย์' ,'กิ่งอำเภอบางเสาธง'  );
            //AMP[58][1]= new Array('-1','639' ,'640' ,'641' ,'642' ,'643' ,'644'  );
            { 1101, 639 }, // เมืองสมุทรปราการ
            { 1102, 640 }, // บางบ่อ
            { 1103, 641 }, // บางพลี
            { 1104, 642 }, // พระประแดง
            { 1105, 643 }, // พระสมุทรเจดีย์
            { 1106, 644 }, // บางเสาธง

            #endregion Samut Prakan

            #region Samut Songkhram

            //AMP[59][0]=new Array('-- อำเภอ --','อำเภอเมืองสมุทรสงคราม' ,'อำเภอบางคนที' ,'อำเภออัมพวา'  );
            //AMP[59][1]= new Array('-1','645' ,'646' ,'647'  );
            { 7501, 645 }, // เมืองสมุทรสงคราม
            { 7502, 646 }, // บางคนที
            { 7503, 647 }, // อัมพวา
            #endregion Samut Songkhram

            #region Samut Sakhon

            //AMP[60][0]=new Array('-- อำเภอ --','อำเภอเมืองสมุทรสาคร' ,'อำเภอกระทุ่มแบน' ,'อำเภอบ้านแพ้ว'  );
            //AMP[60][1]= new Array('-1','648' ,'649' ,'650'  );
            { 7401, 648 }, // เมืองสมุทรสาคร
            { 7402, 649 }, // กระทุ่มแบน
            { 7403, 650 }, // บ้านแพ้ว
            #endregion Samut Sakhon

            #region Sa Kaeo

            //AMP[61][0]=new Array('-- อำเภอ --','อำเภอเมืองสระแก้ว' ,'อำเภอคลองหาด' ,'อำเภอตาพระยา' ,'อำเภอวังน้ำเย็น' ,'อำเภอวัฒนานคร' ,'อำเภออรัญประเทศ' ,'อำเภอโคกสูง' ,'อำเภอเขาฉกรรจ์' ,'กิ่งอำเภอวังสมบูรณ์'  );
            //AMP[61][1]= new Array('-1','651' ,'652' ,'653' ,'654' ,'655' ,'656' ,'657' ,'658' ,'659'  );
            { 2701, 651 }, // เมืองสระแก้ว
            { 2702, 652 }, // คลองหาด
            { 2703, 653 }, // ตาพระยา
            { 2704, 654 }, // วังน้ำเย็น
            { 2705, 655 }, // วัฒนานคร
            { 2706, 656 }, // อรัญประเทศ
            { 2707, 658 }, // เขาฉกรรจ์
            { 2708, 657 }, // โคกสูง
            { 2709, 659 }, // วังสมบูรณ์

            #endregion Sa Kaeo

            #region Saraburi

            //AMP[62][0]=new Array('-- อำเภอ --','อำเภอเมืองสระบุรี' ,'อำเภอแก่งคอย' ,'อำเภอหนองแค' ,'อำเภอวิหารแดง' ,'อำเภอหนองแซง' ,'อำเภอบ้านหมอ' ,'อำเภอดอนพุต' ,'อำเภอหนองโดน' ,'อำเภอพระพุทธบาท' ,'อำเภอเสาไห้' ,'อำเภอมวกเหล็ก' ,'อำเภอวังม่วง' ,'อำเภอเฉลิมพระเกียรติ'  );
            //AMP[62][1]= new Array('-1','660' ,'661' ,'662' ,'663' ,'664' ,'665' ,'666' ,'667' ,'668' ,'669' ,'670' ,'671' ,'672'  );
            { 1901, 660 }, // เมืองสระบุรี
            { 1902, 661 }, // แก่งคอย
            { 1903, 662 }, // หนองแค
            { 1904, 663 }, // วิหารแดง
            { 1905, 664 }, // หนองแซง
            { 1906, 665 }, // บ้านหมอ
            { 1907, 666 }, // ดอนพุด
            { 1908, 667 }, // หนองโดน
            { 1909, 668 }, // พระพุทธบาท
            { 1910, 669 }, // เสาไห้
            { 1911, 670 }, // มวกเหล็ก
            { 1912, 671 }, // วังม่วง
            { 1913, 672 }, // เฉลิมพระเกียรติ
            #endregion Saraburi

            #region Singburi

            //AMP[63][0]=new Array('-- อำเภอ --','อำเภอเมืองสิงห์บุรี' ,'อำเภอบางระจัน' ,'อำเภอค่ายบางระจัน' ,'อำเภอพรหมบุรี' ,'อำเภอท่าช้าง' ,'อำเภออินทร์บุรี'  );
            //AMP[63][1]= new Array('-1','673' ,'674' ,'675' ,'676' ,'677' ,'678'  );
            { 1701, 673 }, // เมืองสิงห์บุรี
            { 1702, 674 }, // บางระจัน
            { 1703, 675 }, // ค่ายบางระจัน
            { 1704, 676 }, // พรหมบุรี
            { 1705, 677 }, // ท่าช้าง
            { 1706, 678 }, // อินทร์บุรี
            #endregion Singburi

            #region Sukhothai

            //AMP[64][0]=new Array('-- อำเภอ --','อำเภอเมืองสุโขทัย' ,'อำเภอบ้านด่านลานหอย' ,'อำเภอคีรีมาศ' ,'อำเภอกงไกรลาศ' ,'อำเภอศรีสัชนาลัย' ,'อำเภอศรีสำโรง' ,'อำเภอสวรรคโลก' ,'อำเภอศรีนคร' ,'อำเภอทุ่งเสลี่ยม'  );
            //AMP[64][1]= new Array('-1','679' ,'680' ,'681' ,'682' ,'683' ,'684' ,'685' ,'686' ,'687'  );
            { 6401, 679 }, // เมืองสุโขทัย
            { 6402, 680 }, // บ้านด่านลานหอย
            { 6403, 681 }, // คีรีมาศ
            { 6404, 682 }, // กงไกรลาศ
            { 6405, 683 }, // ศรีสัชนาลัย
            { 6406, 684 }, // ศรีสำโรง
            { 6407, 685 }, // สวรรคโลก
            { 6408, 686 }, // ศรีนคร
            { 6409, 687 }, // ทุ่งเสลี่ยม
            #endregion Sukhothai

            #region Suphanburi

            //AMP[65][0]=new Array('-- อำเภอ --','อำเภอเมืองสุพรรณบุรี' ,'อำเภอเดิมบางนางบวช' ,'อำเภอด่านช้าง' ,'อำเภอบางปลาม้า' ,'อำเภอศรีประจันต์' ,'อำเภอดอนเจดีย์' ,'อำเภอสองพี่น้อง' ,'อำเภอสามชุก' ,'อำเภออู่ทอง' ,'อำเภอหนองหญ้าไซ'  );
            //AMP[65][1]= new Array('-1','688' ,'689' ,'690' ,'691' ,'692' ,'693' ,'694' ,'695' ,'696' ,'697'  );
            { 7201, 688 }, // เมืองสุพรรณบุรี
            { 7202, 689 }, // เดิมบางนางบวช
            { 7203, 690 }, // ด่านช้าง
            { 7204, 691 }, // บางปลาม้า
            { 7205, 692 }, // ศรีประจันต์
            { 7206, 693 }, // ดอนเจดีย์
            { 7207, 694 }, // สองพี่น้อง
            { 7208, 695 }, // สามชุก
            { 7209, 696 }, // อู่ทอง
            { 7210, 697 }, // หนองหญ้าไซ
            #endregion Suphanburi

            #region Surat Thani

            //AMP[66][0]=new Array('-- อำเภอ --','อำเภอเมืองสุราษฎร์ธานี' ,'อำเภอท่าชนะ' ,'อำเภอคีรีรัฐนิคม' ,'อำเภอบ้านตาขุน' ,'อำเภอพนม' ,'อำเภอท่าฉาง' ,'อำเภอบ้านนาสาร' ,'อำเภอบ้านนาเดิม' ,'อำเภอเคียนซา' ,'อำเภอเวียงสระ' ,'อำเภอพระแสง' ,'อำเภอพุนพิน' ,'อำเภอชัยบุรี' ,'อำเภอดอนสัก' ,'อำเภอเกาะสมุย' ,'อำเภอไชยา' ,'อำเภอกาญจนดิษฐ์' ,'อำเภอเกาะพะงัน' ,'กิ่งอำเภอวิภาวดี (คีรีรัฐนิคม)'  );
            //AMP[66][1]= new Array('-1','698' ,'699' ,'700' ,'701' ,'702' ,'703' ,'704' ,'705' ,'706' ,'707' ,'708' ,'709' ,'710' ,'711' ,'712' ,'713' ,'714' ,'715' ,'716'  );
            { 8401, 698 }, // เมืองสุราษฎร์ธานี
            { 8402, 714 }, // กาญจนดิษฐ์
            { 8403, 711 }, // ดอนสัก
            { 8404, 712 }, // เกาะสมุย
            { 8405, 715 }, // เกาะพะงัน
            { 8406, 713 }, // ไชยา
            { 8407, 699 }, // ท่าชนะ
            { 8408, 700 }, // คีรีรัฐนิคม
            { 8409, 701 }, // บ้านตาขุน
            { 8410, 702 }, // พนม
            { 8411, 703 }, // ท่าฉาง
            { 8412, 704 }, // บ้านนาสาร
            { 8413, 705 }, // บ้านนาเดิม
            { 8414, 706 }, // เคียนซา
            { 8415, 707 }, // เวียงสระ
            { 8416, 708 }, // พระแสง
            { 8417, 709 }, // พุนพิน
            { 8418, 710 }, // ชัยบุรี
            { 8419, 716 }, // วิภาวดี
            #endregion Surat Thani

            #region Surin

            //AMP[67][0]=new Array('-- อำเภอ --','อำเภอเมืองสุรินทร์' ,'อำเภอชุมพลบุรี' ,'อำเภอท่าตูม' ,'อำเภอจอมพระ' ,'อำเภอปราสาท' ,'อำเภอกาบเชิง' ,'อำเภอรัตนบุรี' ,'อำเภอสนม' ,'อำเภอศรีขรภูมิ' ,'อำเภอสังขะ' ,'อำเภอลำดวน' ,'อำเภอสำโรงทาบ' ,'อำเภอบัวเชด' ,'กิ่งอำเภอพนมดงรัก' ,'กิ่งอำเภอศรีณรงค์' ,'กิ่งอำเภอเขวาสินรินทร์' ,'กิ่งอำเภอโนนนารายณ์'  );
            //AMP[67][1]= new Array('-1','717' ,'718' ,'719' ,'720' ,'721' ,'722' ,'723' ,'724' ,'725' ,'726' ,'727' ,'728' ,'729' ,'730' ,'731' ,'732' ,'733'  );
            { 3201, 717 }, // เมืองสุรินทร์
            { 3202, 718 }, // ชุมพลบุรี
            { 3203, 719 }, // ท่าตูม
            { 3204, 720 }, // จอมพระ
            { 3205, 721 }, // ปราสาท
            { 3206, 722 }, // กาบเชิง
            { 3207, 723 }, // รัตนบุรี
            { 3208, 724 }, // สนม
            { 3209, 725 }, // ศีขรภูมิ
            { 3210, 726 }, // สังขะ
            { 3211, 727 }, // ลำดวน
            { 3212, 728 }, // สำโรงทาบ
            { 3213, 729 }, // บัวเชด
            { 3214, 730 }, // พนมดงรัก
            { 3215, 731 }, // ศรีณรงค์
            { 3216, 732 }, // เขวาสินรินทร์
            { 3217, 733 }, // โนนนารายณ์
            #endregion Surin

            #region Nong Khai

            //AMP[68][0]=new Array('-- อำเภอ --','อำเภอเมืองหนองคาย' ,'อำเภอท่าบ่อ' ,'อำเภอบึงกาฬ' ,'อำเภอพรเจริญ' ,'อำเภอโพนพิสัย' ,'อำเภอโซ่พิสัย' ,'อำเภอศรีเชียงใหม่' ,'อำเภอสังคม' ,'อำเภอเซกา' ,'อำเภอปากคาด' ,'อำเภอบึงโขงหลง' ,'อำเภอศรีวิไล' ,'อำเภอบุ้งคล้า' ,'กิ่งอำเภอสระใคร' ,'กิ่งอำเภอเฝ้าไร่' ,'กิ่งอำเภอรัตนวาปี' ,'กิ่งอำเภอโพธิ์ตาก'  );
            //AMP[68][1]= new Array('-1','734' ,'735' ,'736' ,'737' ,'738' ,'739' ,'740' ,'741' ,'742' ,'743' ,'744' ,'745' ,'746' ,'747' ,'748' ,'749' ,'750'  );
            { 4301, 734 }, // เมืองหนองคาย
            { 4302, 735 }, // ท่าบ่อ
            { 4303, 736 }, // บึงกาฬ
            { 4304, 737 }, // พรเจริญ
            { 4305, 738 }, // โพนพิสัย
            { 4306, 739 }, // โซ่พิสัย
            { 4307, 740 }, // ศรีเชียงใหม่
            { 4308, 741 }, // สังคม
            { 4309, 742 }, // เซกา
            { 4310, 743 }, // ปากคาด
            { 4311, 744 }, // บึงโขงหลง
            { 4312, 745 }, // ศรีวิไล
            { 4313, 746 }, // บุ่งคล้า
            { 4314, 747 }, // สระใคร
            { 4315, 748 }, // เฝ้าไร่
            { 4316, 749 }, // รัตนวาปี
            { 4317, 750 }, // โพธิ์ตาก
            #endregion Nong Khai

            #region Nong Bua Lam Phu

            //AMP[69][0]=new Array('-- อำเภอ --','อำเภอเมืองหนองบัวลำภู' ,'อำเภอนากลาง' ,'อำเภอโนนสัง' ,'อำเภอศรีบุญเรือง' ,'อำเภอสุวรรณคูหา' ,'อำเภอนาวัง'  );
            //AMP[69][1]= new Array('-1','751' ,'752' ,'753' ,'754' ,'755' ,'756'  );
            { 3901, 751 }, // เมืองหนองบัวลำภู
            { 3902, 752 }, // นากลาง
            { 3903, 753 }, // โนนสัง
            { 3904, 754 }, // ศรีบุญเรือง
            { 3905, 755 }, // สุวรรณคูหา
            { 3906, 756 }, // นาวัง
            #endregion Nong Bua Lam Phu

            #region Ang Thong

            //AMP[70][0]=new Array('-- อำเภอ --','อำเภอเมืองอ่างทอง' ,'อำเภอไชโย' ,'อำเภอป่าโมก' ,'อำเภอโพธิ์ทอง' ,'อำเภอแสวงหา' ,'อำเภอวิเศษชัยชาญ' ,'อำเภอสามโก้'  );
            //AMP[70][1]= new Array('-1','757' ,'758' ,'759' ,'760' ,'761' ,'762' ,'763'  );
            { 1501, 757 }, // ไชโย
            { 1502, 758 }, // ไชโย
            { 1503, 759 }, // ป่าโมก
            { 1504, 760 }, // โพธิ์ทอง
            { 1505, 761 }, // แสวงหา
            { 1506, 762 }, // วิเศษชัยชาญ
            { 1507, 763 }, // สามโก้
            #endregion Ang Thong

            #region Amnat Charoen

            //AMP[71][0]=new Array('-- อำเภอ --','อำเภอเมืองอำนาจเจริญ' ,'อำเภอหัวตะพาน' ,'อำเภอลืออำนาจ' ,'อำเภอเสนางคนิคม' ,'อำเภอชานุมาน' ,'อำเภอปทุมราชวงศา' ,'อำเภอพนา'  );
            //AMP[71][1]= new Array('-1','764' ,'765' ,'766' ,'767' ,'768' ,'769' ,'770'  );

            { 3701, 764}, // เมืองอำนาจเจริญ
            { 3702, 768}, // ชานุมาน
            { 3703, 769}, // ปทุมราชวงศา
            { 3704, 770}, // พนา
            { 3705, 767}, // เสนางคนิคม
            { 3706, 765}, // หัวตะพาน
            { 3707, 766}, // ลืออำนาจ
            #endregion Amnat Charoen

            #region Udon Thani

            //AMP[72][0]=new Array('-- อำเภอ --','อำเภอเมืองอุดรธานี' ,'อำเภอกุดจับ' ,'อำเภอหนองวอซอ' ,'อำเภอกุมวาปี' ,'อำเภอโนนสะอาด' ,'อำเภอหนองหาน' ,'อำเภอทุ่งฝน' ,'อำเภอไชยวาน' ,'อำเภอศรีธาตุ' ,'อำเภอวังสามหมอ' ,'อำเภอบ้านดุง' ,'อำเภอบ้านผือ' ,'อำเภอน้ำโสม' ,'อำเภอเพ็ญ' ,'อำเภอสร้างคอม' ,'อำเภอหนองแสง' ,'อำเภอนายูง' ,'อำเภอพิบูลย์รักษ์' ,'กิ่งอำเภอกู่แก้ว' ,'กิ่งอำเภอประจักษ์ศิลปาคม'  );
            //AMP[72][1]= new Array('-1','771' ,'772' ,'773' ,'774' ,'775' ,'776' ,'777' ,'778' ,'779' ,'780' ,'781' ,'782' ,'783' ,'784' ,'785' ,'786' ,'787' ,'788' ,'789' ,'790'  );
            { 4101, 771 }, // เมืองอุดรธานี
            { 4102, 772 }, // กุดจับ
            { 4103, 773 }, // หนองวัวซอ
            { 4104, 774 }, // กุมภวาปี
            { 4105, 775 }, // โนนสะอาด
            { 4106, 776 }, // หนองหาน
            { 4107, 777 }, // ทุ่งฝน
            { 4108, 778 }, // ไชยวาน
            { 4109, 779 }, // ศรีธาตุ
            { 4110, 780 }, // วังสามหมอ
            { 4111, 781 }, // บ้านดุง
            { 4117, 782 }, // บ้านผือ
            { 4118, 783 }, // น้ำโสม
            { 4119, 784 }, // เพ็ญ
            { 4120, 785 }, // สร้างคอม
            { 4121, 786 }, // หนองแสง
            { 4122, 787 }, // นายูง
            { 4123, 788 }, // พิบูลย์รักษ์
            { 4124, 789 }, // กู่แก้ว
            { 4125, 790 }, // ประจักษ์ศิลปาคม
            #endregion Udon Thani

            #region Uttaradit

            //AMP[73][0]=new Array('-- อำเภอ --','อำเภอเมืองอุตรดิตถ์' ,'อำเภอตรอน' ,'อำเภอท่าปลา' ,'อำเภอน้ำปาด' ,'อำเภอฟากท่า' ,'อำเภอบ้านโคก' ,'อำเภอพิชัย' ,'อำเภอลับแล' ,'อำเภอทองแสนขัน'  );
            //AMP[73][1]= new Array('-1','791' ,'792' ,'793' ,'794' ,'795' ,'796' ,'797' ,'798' ,'799'  );
            { 5301, 791 }, // เมืองอุตรดิตถ์
            { 5302, 792 }, // ตรอน
            { 5303, 793 }, // ท่าปลา
            { 5304, 794 }, // น้ำปาด
            { 5305, 795 }, // ฟากท่า
            { 5306, 796 }, // บ้านโคก
            { 5307, 797 }, // พิชัย
            { 5308, 798 }, // ลับแล
            { 5309, 799 }, // ทองแสนขัน
            #endregion Uttaradit

            #region Uthai Thani

            //AMP[74][0]=new Array('-- อำเภอ --','อำเภอเมืองอุทัยธานี' ,'อำเภอทัพทัน' ,'อำเภอสว่างอารมณ์' ,'อำเภอหนองฉาง' ,'อำเภอหนองขาหย่าง' ,'อำเภอบ้านไร่' ,'อำเภอลานสัก' ,'อำเภอห้วยคด'  );
            //AMP[74][1]= new Array('-1','800' ,'801' ,'802' ,'803' ,'804' ,'805' ,'806' ,'807'  );
            { 6101, 800 }, // เมืองอุทัยธานี
            { 6102, 801 }, // ทัพทัน
            { 6103, 802 }, // สว่างอารมณ์
            { 6104, 803 }, // หนองฉาง
            { 6105, 804 }, // หนองขาหย่าง
            { 6106, 805 }, // บ้านไร่
            { 6107, 806 }, // ลานสัก
            { 6108, 807 }, // ห้วยคต
            #endregion Uthai Thani

            #region Ubon Ratchathani

            //AMP[75][0]=new Array('-- อำเภอ --','อำเภอเมืองอุบลราชธานี' ,'อำเภอศรีเมืองใหม่' ,'อำเภอโขงเจียม' ,'อำเภอเขื่องใน' ,'อำเภอเขมราฐ' ,'อำเภอเดชอุดม' ,'อำเภอนาจะหลวย' ,'อำเภอน้ำยืน' ,'อำเภอบุญฑริก' ,'อำเภอตระการพืชผล' ,'อำเภอกุดข้าวปุ้น' ,'อำเภอม่วงสามสิบ' ,'อำเภอวารินชำราบ' ,'อำเภอพิบูลมังสาหาร' ,'อำเภอตาลสุม' ,'อำเภอโพธิ์ไทร' ,'อำเภอสำโรง' ,'อำเภอดอนมดแดง' ,'สิรินธร' ,'อำเภอทุ่งศรีอุดม' ,'กิ่งอำเภอนาเยีย' ,'กิ่งอำเภอนาตาล' ,'กิ่งอำเภอเหล่าเสือโก้ก' ,'กิ่งอำเภอสว่างวีรวงศ์' ,'กิ่งอำเภอน้ำขุ่น'  );
            //AMP[75][1]= new Array('-1','808' ,'809' ,'810' ,'811' ,'812' ,'813' ,'814' ,'815' ,'816' ,'817' ,'818' ,'819' ,'820' ,'821' ,'822' ,'823' ,'824' ,'825' ,'826' ,'827' ,'828' ,'829' ,'830' ,'831' ,'832'  );
            { 3401, 808 }, // เมืองอุบลราชธานี
            { 3402, 809 }, // ศรีเมืองใหม่
            { 3403, 810 }, // โขงเจียม
            { 3404, 811 }, // เขื่องใน
            { 3405, 812 }, // เขมราฐ
            { 3407, 813 }, // เดชอุดม
            { 3408, 814 }, // นาจะหลวย
            { 3409, 815 }, // น้ำยืน
            { 3410, 816 }, // บุณฑริก
            { 3411, 817 }, // ตระการพืชผล
            { 3412, 818 }, // กุดข้าวปุ้น
            { 3414, 819 }, // ม่วงสามสิบ
            { 3415, 820 }, // วารินชำราบ
            { 3419, 821 }, // พิบูลมังสาหาร
            { 3420, 822 }, // ตาลสุม
            { 3421, 823 }, // โพธิ์ไทร
            { 3422, 824 }, // สำโรง
            { 3424, 825 }, // ดอนมดแดง
            { 3425, 826 }, // สิรินธร
            { 3426, 827 }, // ทุ่งศรีอุดม
            { 3429, 828 }, // นาเยีย
            { 3430, 829 }, // นาตาล
            { 3431, 830 }, // เหล่าเสือโก้ก
            { 3432, 831 }, // สว่างวีระวงศ์
            { 3433, 832 }, // น้ำขุ่น
            #endregion Ubon Ratchathani
        };

        #endregion _geocodeToAmphoeCom

        #endregion consts

        /// <summary>
        /// Gets the URL on amphoe.com for the given geocode.
        /// </summary>
        /// <param name="geocode">Geocode of the district.</param>
        /// <returns>URL at amphoe.com, or <c>null</c> if no valid URL can be found.</returns>
        public static Uri AmphoeWebsite(UInt32 geocode)
        {
            Int16 provinceCode = 0;
            if ( _provinceToAmphoeCom.TryGetValue(geocode / 100, out provinceCode) )
            {
                Int16 amphoeCode = 0;
                if ( _geocodeToAmphoeCom.TryGetValue(geocode, out amphoeCode) )
                {
                    return new Uri(String.Format("http://www.amphoe.com/menu.php?mid=1&am={0}&pv={1}", amphoeCode, provinceCode));
                }
            }
            return null;
        }
    }
}