using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace De.AHoerstemeier.Tambon
{
    /// <summary>
    /// Helper class to access http://amphoe.com
    /// </summary>
    public static class AmphoeComHelper
    {
        #region consts

        #region _provinceToAmphoeCom

        private static Dictionary<UInt32, Int16> _provinceToAmphoeCom = new Dictionary<UInt32, Int16>() {
            { 81,1},
            { 71,2},
            { 46,3},
            { 62,4},
            { 40,5},
            { 22,6},
            { 24,7},
            { 20,8},
            { 18,9},
            { 36,10},
            { 86,11},
            { 57,12},
            { 50,13},
            { 92,14},
            { 23,15},
            { 63,16},
            { 26,17},
            { 73,18},
            { 48,19},
            { 30,20},
            { 80,21},
            { 60,22},
            { 12,23},
            { 96,24},
            { 55,25},
            { 31,26},
            { 13,27},
            { 77,28},
            { 25,29},
            { 94,30},
            { 14,31},
            { 56,32},
            { 82,33},
            { 93,34},
            { 66,35},
            { 65,36},
            { 76,37},
            { 67,38},
            { 54,39},
            { 83,40},
            { 44,41},
            { 49,42},
            { 58,43},
            { 35,44},
            { 95,45},
            { 45,46},
            { 85,47},
            { 21,48},
            { 70,49},
            { 16,50},
            { 52,51},
            { 51,52},
            { 42,53},
            { 33,54},
            { 47,55},
            { 90,56},
            { 91,57},
            { 11,58},
            { 75,59},
            { 74,60},
            { 27,61},
            { 19,62},
            { 17,63},
            { 64,64},
            { 72,65},
            { 84,66},
            { 32,67},
            { 43,68},
            { 39,69},
            { 15,70},
            { 37,71},
            { 41,72},
            { 53,73},
            { 61,74},
            { 34,75},
        };

        #endregion _provinceToAmphoeCom

        #region _geocodeToAmphoeCom

        private static Dictionary<UInt32, Int16> _geocodeToAmphoeCom = new Dictionary<UInt32, Int16>()
        {
            { 8101, 1},
            { 8108, 2},
            { 8102, 3},
            { 8103, 4},
            { 8104, 5},
            { 8107, 6},
            { 8105, 7},
            { 8106, 8}
        };

        //AMP[2][0]=new Array('-- อำเภอ --','อำเภอเมืองกาญจนบุรี' ,'อำเภอด่านมะขามเตี้ย' ,'อำเภอไทรโยค' ,'อำเภอบ่อพลอย' ,'อำเภอหนองปรือ' ,'อำเภอศรีสวัสดิ์' ,'อำเภอท่ามะกา' ,'อำเภอท่าม่วง' ,'อำเภอทองผาภูมิ' ,'อำเภอสังขละบุรี' ,'อำเภอพนมทวน' ,'อำเภอห้วยกระเจา' ,'อำเภอเลาขวัญ'  );
        //AMP[2][1]= new Array('-1','9' ,'10' ,'11' ,'12' ,'13' ,'14' ,'15' ,'16' ,'17' ,'18' ,'19' ,'20' ,'21'  );
        //AMP[3]=new Array(2);
        //AMP[3][0]=new Array('-- อำเภอ --','อำเภอเมืองกาฬสินธุ์' ,'อำเภอนามน' ,'อำเภอกมลาไสย' ,'อำเภอร่องคำ' ,'อำเภอกุฉินารายณ์' ,'อำเภอเขาวง' ,'อำเภอยางตลาด' ,'อำเภอห้วยเม็ก' ,'อำเภอสหัสขันธ์' ,'อำเภอคำม่วง' ,'อำเภอท่าคันโท' ,'อำเภอหนองกุงศรี' ,'อำเภอสมเด็จ' ,'อำเภอห้วยผึ้ง' ,'กิ่งอำเภอสามชัย' ,'กิ่งอำเภอนาคู' ,'กิ่งอำเภอฆ้องชัย' ,'กิ่งอำเภอดอนจาน'  );
        //AMP[3][1]= new Array('-1','22' ,'23' ,'24' ,'25' ,'26' ,'27' ,'28' ,'29' ,'30' ,'31' ,'32' ,'33' ,'34' ,'35' ,'851' ,'852' ,'853' ,'854'  );
        //AMP[4]=new Array(2);
        //AMP[4][0]=new Array('-- อำเภอ --','อำเภอเมืองกำแพงเพชร' ,'อำเภอคลองลาน' ,'อำเภอไทรงาม' ,'อำเภอขาณุวรลักษบุรี' ,'อำเภอคลองขลุง' ,'อำเภอทรายทองวัฒนา' ,'อำเภอปางศิลาทอง' ,'อำเภอพรานกระต่าย' ,'อำเภอลานกระบือ' ,'กิ่งอำเภอโกสัมพีนคร' ,'กิ่งอำเภอบึงสามัคคี'  );
        //AMP[4][1]= new Array('-1','36' ,'37' ,'38' ,'39' ,'40' ,'41' ,'42' ,'43' ,'44' ,'833' ,'834'  );
        //AMP[5]=new Array(2);
        //AMP[5][0]=new Array('-- อำเภอ --','อำเภอเมืองขอนแก่น' ,'อำเภอบ้านฝาง' ,'อำเภอพระยืน' ,'อำเภอหนองเรือ' ,'อำเภอชุมแพ' ,'อำเภอสีชมพู' ,'อำเภอน้ำพอง' ,'อำเภออุบลรัตน์' ,'อำเภอกระนวน' ,'อำเภอบ้านไผ่' ,'อำเภอเปือยน้อย' ,'อำเภอพล' ,'อำเภอแวงใหญ่' ,'อำเภอแวงน้อย' ,'อำเภอหนองสองห้อง' ,'อำเภอภูเวียง' ,'อำเภอมัญจาคีรี' ,'อำเภอชนบท' ,'อำเภอเขาสวนกวาง' ,'อำเภอภูผาม่าน' ,'กิ่งอำเภอซำสูง' ,'กิ่งอำเภอโคกโพธิ์ชัย' ,'กิ่งอำเภอหนองนาคำ' ,'กิ่งอำเภอบ้านแฮด' ,'กิ่งอำเภอโนนศิลา'  );
        //AMP[5][1]= new Array('-1','45' ,'46' ,'47' ,'48' ,'50' ,'51' ,'52' ,'53' ,'54' ,'55' ,'56' ,'57' ,'58' ,'59' ,'60' ,'61' ,'62' ,'63' ,'64' ,'65' ,'855' ,'856' ,'857' ,'858' ,'859'  );
        //AMP[6]=new Array(2);
        //AMP[6][0]=new Array('-- อำเภอ --','อำเภอเมืองจันทบุรี' ,'อำเภอขลุง' ,'อำเภอท่าใหม่' ,'อำเภอโป่งน้ำร้อน' ,'อำเภอมะขาม' ,'อำเภอแหลมสิงห์' ,'อำเภอสอยดาว' ,'อำเภอแก่งหางแมว' ,'อำเภอนายายอาม' ,'กิ่งอำเภอเขาคิชฌกูฏ'  );
        //AMP[6][1]= new Array('-1','67' ,'68' ,'69' ,'70' ,'71' ,'72' ,'73' ,'74' ,'75' ,'76'  );
        //AMP[7]=new Array(2);
        //AMP[7][0]=new Array('-- อำเภอ --','อำเภอเมืองฉะเชิงเทรา' ,'อำเภอบางคล้า' ,'อำเภอบางน้ำเปรี้ยว' ,'อำเภอบางปะกง' ,'อำเภอบ้านโพธิ์' ,'อำเภอพนมสารคาม' ,'อำเภอราชสาส์น' ,'อำเภอสนามชัยเขต' ,'อำเภอแปลงยาว' ,'อำเภอท่าตะเกียบ' ,'กิ่งอำเภอคลองเขื่อน'  );
        //AMP[7][1]= new Array('-1','77' ,'78' ,'79' ,'80' ,'81' ,'82' ,'83' ,'84' ,'85' ,'86' ,'87'  );
        //AMP[8]=new Array(2);
        //AMP[8][0]=new Array('-- อำเภอ --','อำเภอเมืองชลบุรี' ,'อำเภอบ้านบึง' ,'อำเภอหนองใหญ่' ,'อำเภอบางละมุง' ,'อำเภอพานทอง' ,'อำเภอพนัสนิคม' ,'อำเภอศรีราชา' ,'อำเภอเกาะสีชัง' ,'อำเภอสัตหีบ' ,'อำเภอบ่อทอง' ,'กิ่งอำเภอเกาะจันทร์'  );
        //AMP[8][1]= new Array('-1','88' ,'89' ,'90' ,'91' ,'92' ,'93' ,'94' ,'95' ,'96' ,'97' ,'98'  );
        //AMP[9]=new Array(2);
        //AMP[9][0]=new Array('-- อำเภอ --','อำเภอเมืองชัยนาท' ,'อำเภอมโนรมย์' ,'อำเภอวัดสิงห์' ,'อำเภอสรรพยา' ,'อำเภอสรรคบุรี' ,'อำเภอหันคา' ,'กิ่งอำเภอหนองมะโมง' ,'กิ่งอำเภอเนินขาม'  );
        //AMP[9][1]= new Array('-1','99' ,'100' ,'101' ,'102' ,'103' ,'104' ,'105' ,'106'  );
        //AMP[10]=new Array(2);
        //AMP[10][0]=new Array('-- อำเภอ --','อำเภอเมืองชัยภูมิ' ,'อำเภอบ้านเขว้า' ,'อำเภอคอนสวรรค์' ,'อำเภอเกษตรสมบูรณ์' ,'อำเภอหนองบัวแดง' ,'อำเภอจัตุรัส' ,'อำเภอบำเหน็จณรงค์' ,'อำเภอหนองบัวระเหว' ,'อำเภอเทพสถิต' ,'อำเภอภูเขียว' ,'อำเภอบ้านแท่น' ,'อำเภอแก้งคร้อ' ,'อำเภอคอนสาร' ,'อำเภอภักดีชุมพล' ,'อำเภอเนินสง่า' ,'กิ่งอำเภอซับใหญ่'  );
        //AMP[10][1]= new Array('-1','107' ,'108' ,'109' ,'110' ,'111' ,'112' ,'113' ,'114' ,'115' ,'116' ,'117' ,'118' ,'119' ,'120' ,'121' ,'860'  );
        //AMP[11]=new Array(2);
        //AMP[11][0]=new Array('-- อำเภอ --','อำเภอเมืองชุมพร' ,'อำเภอพะโต๊ะ' ,'อำเภอสวี' ,'อำเภอทุ่งตะโก' ,'อำเภอละแม' ,'อำเภอท่าแซะ' ,'อำเภอปะทิว' ,'อำเภอหลังสวน'  );
        //AMP[11][1]= new Array('-1','122' ,'123' ,'124' ,'125' ,'126' ,'127' ,'128' ,'129'  );
        //AMP[12]=new Array(2);
        //AMP[12][0]=new Array('-- อำเภอ --','อำเภอเมืองเชียงราย' ,'อำเภอเวียงชัย' ,'อำเภอเชียงของ' ,'อำเภอเทิง' ,'อำเภอพาน' ,'อำเภอป่าแดด' ,'อำเภอแม่จัน' ,'อำเภอเชียงแสน' ,'อำเภอแม่สาย' ,'อำเภอแม่สรวย' ,'อำเภอเวียงป่าเป้า' ,'อำเภอพญาเม็งราย' ,'อำเภอเวียงแก่น' ,'อำเภอขุนตาล' ,'อำเภอแม่ฟ้าหลวง' ,'อำเภอแม่ลาว' ,'กิ่งอำเภอเวียงเชียงรุ้ง' ,'กิ่งอำเภอดอยหลวง'  );
        //AMP[12][1]= new Array('-1','130' ,'131' ,'132' ,'133' ,'134' ,'135' ,'136' ,'137' ,'138' ,'139' ,'140' ,'141' ,'142' ,'143' ,'144' ,'145' ,'835' ,'836'  );
        //AMP[13]=new Array(2);
        //AMP[13][0]=new Array('-- อำเภอ --','อำเภอเมืองเชียงใหม่' ,'อำเภอจอมทอง' ,'อำเภอแม่แจ่ม' ,'อำเภอเชียงดาว' ,'อำเภอดอยสะเก็ด' ,'อำเภอแม่แตง' ,'อำเภอแม่ริม' ,'อำเภอสะเมิง' ,'อำเภอฝาง' ,'อำเภอแม่อาย' ,'อำเภอพร้าว' ,'อำเภอสันป่าตอง' ,'อำเภอสันกำแพง' ,'อำเภอสันทราย' ,'อำเภอหางดง' ,'อำเภอฮอด' ,'อำเภอดอยเต่า' ,'อำเภออมก๋อย' ,'อำเภอสารภี' ,'อำเภอเวียงแหง' ,'อำเภอไชยปราการ' ,'อำเภอแม่วาง' ,'กิ่งอำเภอแม่ออน' ,'กิ่งอำเภอดอยหล่อ'  );
        //AMP[13][1]= new Array('-1','146' ,'147' ,'148' ,'149' ,'150' ,'151' ,'152' ,'153' ,'154' ,'155' ,'156' ,'157' ,'158' ,'159' ,'160' ,'161' ,'162' ,'163' ,'164' ,'165' ,'166' ,'167' ,'837' ,'838'  );
        //AMP[14]=new Array(2);
        //AMP[14][0]=new Array('-- อำเภอ --','อำเภอเมืองตรัง' ,'อำเภอกันตัง' ,'อำเภอย่านตาขาว' ,'อำเภอปะเหลียน' ,'อำเภอสิเกา' ,'อำเภอห้วยยอด' ,'อำเภอวังวิเศษ' ,'อำเภอนาโยง' ,'อำเภอรัษฎา' ,'กิ่งอำเภอหาดสำราญ'  );
        //AMP[14][1]= new Array('-1','168' ,'169' ,'170' ,'171' ,'172' ,'173' ,'174' ,'175' ,'176' ,'177'  );
        //AMP[15]=new Array(2);
        //AMP[15][0]=new Array('-- อำเภอ --','อำเภอเมืองตราด' ,'อำเภอคลองใหญ่' ,'อำเภอเขาสมิง' ,'อำเภอบ่อไร่' ,'อำเภอแหลมงอบ' ,'กิ่งอำเภอเกาะกูด' ,'กิ่งอำเภอเกาะช้าง'  );
        //AMP[15][1]= new Array('-1','178' ,'179' ,'180' ,'181' ,'182' ,'183' ,'184'  );
        //AMP[16]=new Array(2);
        //AMP[16][0]=new Array('-- อำเภอ --','อำเภอเมืองตาก' ,'อำเภอบ้านตาก' ,'อำเภอสามเงา' ,'อำเภอแม่ระมาด' ,'อำเภอท่าสองยาง' ,'อำเภอแม่สอด' ,'อำเภอพบพระ' ,'อำเภออุ้มผาง' ,'กิ่งอำเภอวังเจ้า'  );
        //AMP[16][1]= new Array('-1','185' ,'186' ,'187' ,'188' ,'189' ,'190' ,'191' ,'192' ,'839'  );
        //AMP[17]=new Array(2);
        //AMP[17][0]=new Array('-- อำเภอ --','อำเภอเมืองนครนายก' ,'อำเภอปากพลี' ,'อำเภอบ้านนา' ,'อำเภอองครักษ์'  );
        //AMP[17][1]= new Array('-1','193' ,'194' ,'195' ,'196'  );
        //AMP[18]=new Array(2);
        //AMP[18][0]=new Array('-- อำเภอ --','อำเภอเมืองนครปฐม' ,'อำเภอบางเลน' ,'อำเภอสามพราน' ,'อำเภอพุทธมณฑล' ,'อำเภอกำแพงแสน' ,'อำเภอนครชัยศรี' ,'อำเภอดอนตูม'  );
        //AMP[18][1]= new Array('-1','197' ,'198' ,'199' ,'200' ,'201' ,'202' ,'203'  );
        //AMP[19]=new Array(2);
        //AMP[19][0]=new Array('-- อำเภอ --','อำเภอเมืองนครพนม' ,'อำเภอปลาปาก' ,'อำเภอท่าอุเทน' ,'อำเภอบ้านแพง' ,'อำเภอธาตุพนม' ,'อำเภอเรณูนคร' ,'อำเภอนาแก' ,'อำเภอศรีสงคราม' ,'อำเภอนาหว้า' ,'อำเภอโพนสวรรค์' ,'อำเภอนาทม' ,'กิ่งอำเภอวังยาง'  );
        //AMP[19][1]= new Array('-1','204' ,'205' ,'206' ,'207' ,'208' ,'209' ,'210' ,'211' ,'212' ,'213' ,'214' ,'861'  );
        //AMP[20]=new Array(2);
        //AMP[20][0]=new Array('-- อำเภอ --','อำเภอเมืองนครราชสีมา' ,'อำเภอครบุรี' ,'อำเภอเสิงสาง' ,'อำเภอคง' ,'อำเภอบ้านเหลื่อม' ,'อำเภอจักราช' ,'อำเภอโชคชัย' ,'อำเภอด่านขุนทด' ,'อำเภอโนนไทย' ,'อำเภอโนนสูง' ,'อำเภอขามสะแกแสง' ,'อำเภอบัวใหญ่' ,'อำเภอประทาย' ,'อำเภอปักธงชัย' ,'อำเภอพิมาย' ,'อำเภอห้วยแถลง' ,'อำเภอชุมพวง' ,'อำเภอสูงเนิน' ,'อำเภอขามทะเลสอ' ,'อำเภอสีคิ้ว' ,'อำเภอปากช่อง' ,'อำเภอหนองบุญนาก' ,'อำเภอแก้งสนามนาง' ,'อำเภอโนนแดง' ,'อำเภอวังน้ำเขียว' ,'อำเภอเฉลิมพระเกียรติ' ,'กิ่งอำเภอเมืองยาง' ,'กิ่งอำเภอบัวลาย' ,'กิ่งอำเภอสีดา' ,'กิ่งอำเภอเทพารักษ์' ,'กิ่งอำเภอพระทองคำ' ,'กิ่งอำเภอลำทะเมนชัย'  );
        //AMP[20][1]= new Array('-1','215' ,'216' ,'217' ,'218' ,'219' ,'220' ,'221' ,'222' ,'223' ,'224' ,'225' ,'226' ,'227' ,'228' ,'229' ,'230' ,'231' ,'232' ,'233' ,'234' ,'235' ,'236' ,'237' ,'238' ,'239' ,'240' ,'862' ,'863' ,'864' ,'865' ,'866' ,'867'  );
        //AMP[21]=new Array(2);
        //AMP[21][0]=new Array('-- อำเภอ --','อำเภอเมืองนครศรีธรรมราช' ,'อำเภอพรหมคีรี' ,'อำเภอลานสกา' ,'อำเภอฉวาง' ,'อำเภอพิปูน' ,'อำเภอเชียรใหญ่' ,'อำเภอชะอวด' ,'อำเภอท่าศาลา' ,'อำเภอทุ่งสง' ,'อำเภอนาบอน' ,'อำเภอทุ่งใหญ่' ,'อำเภอปากพนัง' ,'อำเภอร่อนพิบูลย์' ,'อำเภอสิชล' ,'อำเภอหัวไทร' ,'อำเภอขนอม' ,'อำเภอบางขัน' ,'อำเภอจุฬาภรณ์' ,'อำเภอถ้ำพรรณรา' ,'อำเภอเฉลิมพระเกียรติ' ,'อำเภอพระพรหม' ,'กิ่งอำเภอนบพิตำ' ,'กิ่งอำเภอช้างกลาง'  );
        //AMP[21][1]= new Array('-1','241' ,'242' ,'243' ,'244' ,'245' ,'246' ,'247' ,'248' ,'249' ,'250' ,'251' ,'252' ,'253' ,'254' ,'255' ,'256' ,'257' ,'258' ,'259' ,'260' ,'261' ,'262' ,'263'  );
        //AMP[22]=new Array(2);
        //AMP[22][0]=new Array('-- อำเภอ --','อำเภอเมืองนครสวรรค์' ,'อำเภอโกรกพระ' ,'อำเภอชุมแสง' ,'อำเภอหนองบัว' ,'อำเภอบรรพรตพิสัย' ,'อำเภอตาคลี' ,'อำเภอท่าตะโก' ,'อำเภอพยุหะคีรี' ,'อำเภอลาดยาว' ,'อำเภอไพศาลี' ,'อำเภอตากฟ้า' ,'อำเภอเก้าเลี้ยว' ,'อำเภอแม่วงก์' ,'กิ่งอำเภอชุมตาบง' ,'กิ่งอำเภอแม่เปิน'  );
        //AMP[22][1]= new Array('-1','264' ,'265' ,'266' ,'267' ,'268' ,'269' ,'270' ,'271' ,'272' ,'273' ,'274' ,'275' ,'276' ,'840' ,'841'  );
        //AMP[23]=new Array(2);
        //AMP[23][0]=new Array('-- อำเภอ --','อำเภอเมืองนนทบุรี' ,'อำเภอบางกรวย' ,'อำเภอบางใหญ่' ,'อำเภอบางบัวทอง' ,'อำเภอไทรน้อย' ,'อำเภอปากเกร็ด'  );
        //AMP[23][1]= new Array('-1','277' ,'278' ,'279' ,'280' ,'281' ,'282'  );
        //AMP[24]=new Array(2);
        //AMP[24][0]=new Array('-- อำเภอ --','อำเภอเมืองนราธิวาส' ,'อำเภอตากใบ' ,'อำเภอบาเจาะ' ,'อำเภอยี่งอ' ,'อำเภอระแงะ' ,'อำเภอรือเสาะ' ,'อำเภอศรีสาคร' ,'อำเภอแว้ง' ,'อำเภอสุคิริน' ,'อำเภอสุไหงโก-ลก' ,'อำเภอสุไหงปาดี' ,'อำเภอจะแนะ' ,'อำเภอเจาะไอร้อง'  );
        //AMP[24][1]= new Array('-1','283' ,'284' ,'285' ,'286' ,'287' ,'288' ,'289' ,'290' ,'291' ,'292' ,'293' ,'294' ,'295'  );
        //AMP[25]=new Array(2);
        //AMP[25][0]=new Array('-- อำเภอ --','อำเภอเมืองน่าน' ,'อำเภอแม่จริม' ,'อำเภอบ้านหลวง' ,'อำเภอนาน้อย' ,'อำเภอปัว' ,'อำเภอท่าวังผา' ,'อำเภอทุ่งช้าง' ,'อำเภอเชียงกลาง' ,'อำเภอนาหมื่น' ,'อำเภอสันติสุข' ,'อำเภอบ่อเกลือ' ,'อำเภอสองแคว' ,'อำเภอเฉลิมพระเกียรติ' ,'อำเภอเวียงสา' ,'กิ่งอำเภอภูเพียง'  );
        //AMP[25][1]= new Array('-1','296' ,'297' ,'298' ,'299' ,'300' ,'301' ,'302' ,'303' ,'304' ,'305' ,'306' ,'307' ,'308' ,'842' ,'849'  );
        //AMP[26]=new Array(2);
        //AMP[26][0]=new Array('-- อำเภอ --','อำเภอเมืองบุรีรัมย์' ,'อำเภอชำนิ' ,'อำเภอบ้านใหม่ไชยพจน์' ,'อำเภอโนนดินแดง' ,'อำเภอเฉลิมพระเกียรติ' ,'อำเภอโนนสุวรรณ' ,'อำเภอคูเมือง' ,'อำเภอกระสัง' ,'อำเภอนางรอง' ,'อำเภอหนองกี่' ,'อำเภอละหานทราย' ,'อำเภอประโคนชัย' ,'อำเภอบ้านกรวด' ,'อำเภอพุทไธสง' ,'อำเภอลำปลายมาศ' ,'อำเภอสตึก' ,'อำเภอปะคำ' ,'อำเภอนาโพธิ์' ,'อำเภอหนองหงส์' ,'อำเภอพลับพลาชัย' ,'อำเภอห้วยราช' ,'กิ่งอำเภอบ้านด่าน' ,'กิ่งอำเภอแดนดง'  );
        //AMP[26][1]= new Array('-1','309' ,'310' ,'311' ,'312' ,'313' ,'314' ,'315' ,'316' ,'317' ,'318' ,'319' ,'320' ,'321' ,'322' ,'323' ,'324' ,'325' ,'326' ,'327' ,'328' ,'329' ,'868' ,'869'  );
        //AMP[27]=new Array(2);
        //AMP[27][0]=new Array('-- อำเภอ --','อำเภอเมืองปทุมธานี' ,'อำเภอคลองหลวง' ,'อำเภอธัญบุรี' ,'อำเภอหนองเสือ' ,'อำเภอลาดหลุมแก้ว' ,'อำเภอลำลูกกา' ,'อำเภอสามโคก'  );
        //AMP[27][1]= new Array('-1','330' ,'331' ,'332' ,'333' ,'334' ,'335' ,'336'  );
        //AMP[28]=new Array(2);
        //AMP[28][0]=new Array('-- อำเภอ --','อำเภอเมืองประจวบคีรีขันธ์' ,'อำเภอกุยบุรี' ,'อำเภอทับสะแก' ,'อำเภอบางสะพาน' ,'อำเภอบางสะพานน้อย' ,'อำเภอปราณบุรี' ,'อำเภอหัวหิน' ,'อำเภอสามร้อยยอด'  );
        //AMP[28][1]= new Array('-1','337' ,'338' ,'339' ,'340' ,'341' ,'342' ,'343' ,'344'  );
        //AMP[29]=new Array(2);
        //AMP[29][0]=new Array('-- อำเภอ --','อำเภอเมืองปราจีนบุรี' ,'อำเภอกบินทร์บุรี' ,'อำเภอนาดี' ,'อำเภอบ้านสร้าง' ,'อำเภอประจันตคาม' ,'อำเภอศรีมหาโพธิ' ,'อำเภอศรีมโหสถ'  );
        //AMP[29][1]= new Array('-1','345' ,'346' ,'347' ,'348' ,'349' ,'350' ,'351'  );
        //AMP[30]=new Array(2);
        //AMP[30][0]=new Array('-- อำเภอ --','อำเภอเมืองปัตตานี' ,'อำเภอโคกโพธิ์' ,'อำเภอหนองจิก' ,'อำเภอปานาเระ' ,'อำเภอมายอ' ,'อำเภอทุ่งยางแดง' ,'อำเภอสายบุรี' ,'อำเภอไม้แก่น' ,'อำเภอยะหริ่ง' ,'อำเภอยะรัง' ,'อำเภอกะพ้อ' ,'อำเภอแม่ลาน'  );
        //AMP[30][1]= new Array('-1','352' ,'353' ,'354' ,'355' ,'356' ,'357' ,'358' ,'359' ,'360' ,'361' ,'362' ,'363'  );
        //AMP[31]=new Array(2);
        //AMP[31][0]=new Array('-- อำเภอ --','อำเภอพระนครศรีอยุธยา' ,'อำเภอท่าเรือ' ,'อำเภอนครหลวง' ,'อำเภอบางไทร' ,'อำเภอบางบาล' ,'อำเภอบางปะอิน' ,'อำเภอบางปะหัน' ,'อำเภอผักไห่' ,'อำเภอภาชี' ,'อำเภอลาดบัวหลวง' ,'อำเภอวังน้อย' ,'อำเภอเสนา' ,'อำเภอบางซ้าย' ,'อำเภออุทัย' ,'อำเภอมหาราช' ,'อำเภอบ้านแพรก'  );
        //AMP[31][1]= new Array('-1','364' ,'365' ,'366' ,'367' ,'368' ,'369' ,'370' ,'371' ,'372' ,'373' ,'374' ,'375' ,'376' ,'377' ,'378' ,'379'  );
        //AMP[32]=new Array(2);
        //AMP[32][0]=new Array('-- อำเภอ --','อำเภอเมืองพะเยา' ,'อำเภอจุน' ,'อำเภอเชียงคำ' ,'อำเภอเชียงม่วน' ,'อำเภอดอกคำใต้' ,'อำเภอปง' ,'อำเภอแม่ใจ' ,'กิ่งอำเภอภูกามยาว' ,'กิ่งอำเภอภูซาง'  );
        //AMP[32][1]= new Array('-1','380' ,'381' ,'382' ,'383' ,'384' ,'385' ,'386' ,'843' ,'844'  );
        //AMP[33]=new Array(2);
        //AMP[33][0]=new Array('-- อำเภอ --','อำเภอเมืองพังงา' ,'อำเภอกะปง' ,'อำเภอตะกั่วทุ่ง' ,'อำเภอตะกั่วป่า' ,'อำเภอคุระบุรี' ,'อำเภอทับปุด' ,'อำเภอท้ายเหมือง' ,'อำเภอเกาะยาว'  );
        //AMP[33][1]= new Array('-1','387' ,'388' ,'389' ,'390' ,'391' ,'392' ,'393' ,'394'  );
        //AMP[34]=new Array(2);
        //AMP[34][0]=new Array('-- อำเภอ --','อำเภอเมืองพัทลุง' ,'อำเภอกงหรา' ,'อำเภอเขาชัยสน' ,'อำเภอตะโหมด' ,'อำเภอควนขนุน' ,'อำเภอปากพะยูน' ,'อำเภอศรีบรรพต' ,'อำเภอป่าบอน' ,'อำเภอบางแก้ว' ,'อำเภอป่าพะยอม' ,'กิ่งอำเภอศรีนครินทร์ (เมือง)'  );
        //AMP[34][1]= new Array('-1','395' ,'396' ,'397' ,'398' ,'399' ,'400' ,'401' ,'402' ,'403' ,'404' ,'405'  );
        //AMP[35]=new Array(2);
        //AMP[35][0]=new Array('-- อำเภอ --','อำเภอเมืองพิจิตร' ,'อำเภอโพธิ์ประทับช้าง' ,'อำเภอตะพานหิน' ,'อำเภอบางมูลนาก' ,'อำเภอวังทรายพูน' ,'อำเภอโพทะเล' ,'อำเภอสามง่าม' ,'อำเภอทับคล้อ' ,'อำเภอวชิรบารมี' ,'กิ่งอำเภอดงเจริญ' ,'กิ่งอำเภอบึงนาราง' ,'กิ่งอำเภอสากเหล็ก'  );
        //AMP[35][1]= new Array('-1','406' ,'407' ,'408' ,'409' ,'410' ,'411' ,'412' ,'413' ,'845' ,'846' ,'847' ,'850'  );
        //AMP[36]=new Array(2);
        //AMP[36][0]=new Array('-- อำเภอ --','อำเภอเมืองพิษณุโลก' ,'อำเภอนครไทย' ,'อำเภอชาติตระการ' ,'อำเภอบางระกำ' ,'อำเภอบางกระทุ่ม' ,'อำเภอพรหมพิราม' ,'อำเภอวัดโบสถ์' ,'อำเภอวังทอง' ,'อำเภอเนินมะปราง'  );
        //AMP[36][1]= new Array('-1','414' ,'415' ,'416' ,'417' ,'418' ,'419' ,'420' ,'421' ,'422'  );
        //AMP[37]=new Array(2);
        //AMP[37][0]=new Array('-- อำเภอ --','อำเภอเมืองเพชรบุรี' ,'อำเภอเขาย้อย' ,'อำเภอหนองหญ้าปล้อง' ,'อำเภอชะอำ' ,'อำเภอท่ายาง' ,'อำเภอบ้านลาด' ,'อำเภอบ้านแหลม' ,'อำเภอแก่งกระจาน'  );
        //AMP[37][1]= new Array('-1','423' ,'424' ,'425' ,'426' ,'427' ,'428' ,'429' ,'430'  );
        //AMP[38]=new Array(2);
        //AMP[38][0]=new Array('-- อำเภอ --','อำเภอเมืองเพชรบูรณ์' ,'อำเภอชนแดน' ,'อำเภอหล่มสัก' ,'อำเภอหล่มเก่า' ,'อำเภอวิเชียรบุรี' ,'อำเภอศรีเทพ' ,'อำเภอหนองไผ่' ,'อำเภอบึงสามพัน' ,'อำเภอน้ำหนาว' ,'อำเภอวังโป่ง' ,'อำเภอเขาค้อ'  );
        //AMP[38][1]= new Array('-1','431' ,'432' ,'433' ,'434' ,'435' ,'436' ,'437' ,'438' ,'439' ,'440' ,'441'  );
        //AMP[39]=new Array(2);
        //AMP[39][0]=new Array('-- อำเภอ --','อำเภอเมืองแพร่' ,'อำเภอร้องกวาง' ,'อำเภอลอง' ,'อำเภอหนองม่วงไข่' ,'อำเภอสูงเม่น' ,'อำเภอเด่นชัย' ,'อำเภอสอง' ,'อำเภอวังชิ้น'  );
        //AMP[39][1]= new Array('-1','442' ,'443' ,'444' ,'445' ,'446' ,'447' ,'448' ,'449'  );
        //AMP[40]=new Array(2);
        //AMP[40][0]=new Array('-- อำเภอ --','อำเภอเมืองภูเก็ต' ,'อำเภอกะทู้' ,'อำเภอถลาง'  );
        //AMP[40][1]= new Array('-1','450' ,'451' ,'452'  );
        //AMP[41]=new Array(2);
        //AMP[41][0]=new Array('-- อำเภอ --','อำเภอเมืองมหาสารคาม' ,'อำเภอแกดำ' ,'อำเภอโกสุมพิสัย' ,'อำเภอกันทรวิชัย' ,'อำเภอเชียงยืน' ,'อำเภอบรบือ' ,'อำเภอนาเชือก' ,'อำเภอพยัคฆภูมิพิสัย' ,'อำเภอวาปีปทุม' ,'อำเภอนาดูน' ,'อำเภอยางสีสุราช' ,'กิ่งอำเภอกุดรัง' ,'กิ่งอำเภอชื่นชม'  );
        //AMP[41][1]= new Array('-1','453' ,'454' ,'455' ,'456' ,'457' ,'458' ,'459' ,'460' ,'461' ,'462' ,'463' ,'870' ,'871'  );
        //AMP[42]=new Array(2);
        //AMP[42][0]=new Array('-- อำเภอ --','อำเภอเมืองมุกดาหาร' ,'อำเภอนิคมคำสร้อย' ,'อำเภอดอนตาล' ,'อำเภอดงหลวง' ,'อำเภอคำชะอี' ,'อำเภอหว้านใหญ่' ,'อำเภอหนองสูง'  );
        //AMP[42][1]= new Array('-1','464' ,'465' ,'466' ,'467' ,'468' ,'469' ,'470'  );
        //AMP[43]=new Array(2);
        //AMP[43][0]=new Array('-- อำเภอ --','อำเภอเมืองแม่ฮ่องสอน' ,'อำเภอขุนยวม' ,'อำเภอปาย' ,'อำเภอแม่สะเรียง' ,'อำเภอแม่ลาน้อย' ,'อำเภอสบเมย' ,'อำเภอปางมะผ้า'  );
        //AMP[43][1]= new Array('-1','471' ,'472' ,'473' ,'474' ,'475' ,'476' ,'477'  );
        //AMP[44]=new Array(2);
        //AMP[44][0]=new Array('-- อำเภอ --','อำเภอเมืองยโสธร' ,'อำเภอทรายมูล' ,'อำเภอกุดชุม' ,'อำเภอคำเขื่อนแก้ว' ,'อำเภอป่าติ้ว' ,'อำเภอมหาชนะชัย' ,'อำเภอค้อวัง' ,'อำเภอเลิงนกทา' ,'อำเภอไทยเจริญ'  );
        //AMP[44][1]= new Array('-1','478' ,'479' ,'480' ,'481' ,'482' ,'483' ,'484' ,'485' ,'486'  );
        //AMP[45]=new Array(2);
        //AMP[45][0]=new Array('-- อำเภอ --','อำเภอเมืองยะลา' ,'อำเภอเบตง' ,'อำเภอบันนังสตา' ,'อำเภอธารโต' ,'อำเภอยะหา' ,'อำเภอรามัน' ,'อำเภอกรงปีนัง' ,'อำเภอกาบัง'  );
        //AMP[45][1]= new Array('-1','487' ,'488' ,'489' ,'490' ,'491' ,'492' ,'493' ,'494'  );
        //AMP[46]=new Array(2);
        //AMP[46][0]=new Array('-- อำเภอ --','อำเภอเมืองร้อยเอ็ด' ,'อำเภอจตุรพักตรพิมาน' ,'อำเภอธวัชบุรี' ,'อำเภอพนมไพร' ,'อำเภอโพนทอง' ,'อำเภอโพธิ์ชัย' ,'อำเภอหนองพอก' ,'อำเภอเสลภูมิ' ,'อำเภอสุวรรณภูมิ' ,'อำเภอเมืองสรวง' ,'อำเภอโพนทราย' ,'อำเภออาจสามารถ' ,'อำเภอเมยวดี' ,'อำเภอศรีสมเด็จ' ,'อำเภอจังหาร' ,'อำเภอปทุมรัตต์' ,'อำเภอเกษตรวิสัย' ,'กิ่งอำเภอเชียงขวัญ' ,'กิ่งอำเภอหนองฮี' ,'กิ่งอำเภอทุ่งเขาหลวง'  );
        //AMP[46][1]= new Array('-1','495' ,'496' ,'497' ,'498' ,'499' ,'500' ,'501' ,'502' ,'503' ,'504' ,'505' ,'506' ,'507' ,'508' ,'509' ,'510' ,'511' ,'872' ,'873' ,'874'  );
        //AMP[47]=new Array(2);
        //AMP[47][0]=new Array('-- อำเภอ --','อำเภอเมืองระนอง' ,'อำเภอละอุ่น' ,'อำเภอกะเปอร์' ,'อำเภอกระบุรี' ,'กิ่งอำเภอสุขสำราญ  (กะเปอร์)'  );
        //AMP[47][1]= new Array('-1','512' ,'513' ,'514' ,'515' ,'516'  );
        //AMP[48]=new Array(2);
        //AMP[48][0]=new Array('-- อำเภอ --','อำเภอเมืองระยอง' ,'อำเภอบ้านค่าย' ,'อำเภอปลวกแดง' ,'อำเภอเขาชะเมา' ,'อำเภอนิคมพัฒนา' ,'อำเภอแกลง' ,'อำเภอบ้านฉาง' ,'อำเภอวังจันทร์'  );
        //AMP[48][1]= new Array('-1','517' ,'518' ,'519' ,'520' ,'521' ,'522' ,'523' ,'524'  );
        //AMP[49]=new Array(2);
        //AMP[49][0]=new Array('-- อำเภอ --','อำเภอเมืองราชบุรี' ,'อำเภอจอมบึง' ,'อำเภอสวนผึ้ง' ,'อำเภอดำเนินสะดวก' ,'อำเภอบ้านโป่ง' ,'อำเภอบางแพ' ,'อำเภอโพธาราม' ,'อำเภอปากท่อ' ,'อำเภอวัดเพลง' ,'อำเภอบ้านคา'  );
        //AMP[49][1]= new Array('-1','525' ,'526' ,'527' ,'528' ,'529' ,'530' ,'531' ,'532' ,'533' ,'534'  );
        //AMP[50]=new Array(2);
        //AMP[50][0]=new Array('-- อำเภอ --','อำเภอเมืองลพบุรี' ,'อำเภอพัฒนานิคม' ,'อำเภอโคกสำโรง' ,'อำเภอหนองม่วง' ,'อำเภอสระโบสถ์' ,'อำเภอโคกเจริญ' ,'อำเภอชัยบาดาล' ,'อำเภอลำสนธิ' ,'อำเภอท่าหลวง' ,'อำเภอท่าวุ้ง' ,'อำเภอบ้านหมี่'  );
        //AMP[50][1]= new Array('-1','535' ,'536' ,'537' ,'538' ,'539' ,'540' ,'541' ,'542' ,'543' ,'544' ,'545'  );
        //AMP[51]=new Array(2);
        //AMP[51][0]=new Array('-- อำเภอ --','อำเภอเมืองลำปาง' ,'อำเภอแม่เมาะ' ,'อำเภอเกาะคา' ,'อำเภอเสริมงาม' ,'อำเภองาว' ,'อำเภอแจ้ห่ม' ,'อำเภอวังเหนือ' ,'อำเภอเถิน' ,'อำเภอแม่พริก' ,'อำเภอแม่ทะ' ,'อำเภอสบปราบ' ,'อำเภอห้างฉัตร' ,'อำเภอเมืองปาน'  );
        //AMP[51][1]= new Array('-1','546' ,'547' ,'548' ,'549' ,'550' ,'551' ,'552' ,'553' ,'554' ,'555' ,'556' ,'557' ,'558'  );
        //AMP[52]=new Array(2);
        //AMP[52][0]=new Array('-- อำเภอ --','อำเภอเมืองลำพูน' ,'อำเภอทุ่งหัวช้าง' ,'อำเภอป่าซาง' ,'อำเภอบ้านธิ' ,'อำเภอลี้' ,'อำเภอแม่ทา' ,'อำเภอบ้านโฮ่ง' ,'กิ่งอำเภอเวียงหนองล่อง'  );
        //AMP[52][1]= new Array('-1','559' ,'560' ,'561' ,'562' ,'563' ,'564' ,'565' ,'848'  );
        //AMP[53]=new Array(2);
        //AMP[53][0]=new Array('-- อำเภอ --','อำเภอเมืองเลย' ,'อำเภอนาด้วง' ,'อำเภอเชียงคาน' ,'อำเภอปากชม' ,'อำเภอด่านซ้าย' ,'อำเภอนาแห้ว' ,'อำเภอภูเรือ' ,'อำเภอท่าลี่' ,'อำเภอวังสะพุง' ,'อำเภอภูกระดึง' ,'อำเภอภูหลวง' ,'อำเภอผาขาว' ,'กิ่งอำเภอเอราวัณ' ,'กิ่งอำเภอหนองหิน'  );
        //AMP[53][1]= new Array('-1','566' ,'567' ,'568' ,'569' ,'570' ,'571' ,'572' ,'573' ,'574' ,'575' ,'576' ,'577' ,'875' ,'876'  );
        //AMP[54]=new Array(2);
        //AMP[54][0]=new Array('-- อำเภอ --','อำเภอเมืองศรีสะเกษ' ,'อำเภอยางชุมน้อย' ,'อำเภอกันทรารมย์' ,'อำเภอกันทราลักษ์' ,'อำเภอขุขันธ์' ,'อำเภอไพรบึง' ,'อำเภอปรางค์กู่' ,'อำเภอขุนหาญ' ,'อำเภอราศีไศล' ,'อำเภออุทุมพรพิสัย' ,'อำเภอบึงบูรพ์' ,'อำเภอห้วยทับทัน' ,'อำเภอโนนคูน' ,'อำเภอศรีรัตนะ' ,'อำเภอน้ำเกลี้ยง' ,'อำเภอวังหิน' ,'อำเภอภูสิงห์' ,'อำเภอเมืองจันทร์' ,'อำเภอเบญจลักษณ์' ,'อำเภอพยุห์' ,'กิ่งอำเภอโพธิ์ศรีสุวรรณ' ,'กิ่งอำเภอศิลาลาด'  );
        //AMP[54][1]= new Array('-1','578' ,'579' ,'580' ,'581' ,'582' ,'583' ,'584' ,'585' ,'586' ,'587' ,'588' ,'589' ,'590' ,'591' ,'592' ,'593' ,'594' ,'595' ,'596' ,'597' ,'877' ,'878'  );
        //AMP[55]=new Array(2);
        //AMP[55][0]=new Array('-- อำเภอ --','อำเภอเมืองสกลนคร' ,'อำเภอกุสุมาลย์' ,'อำเภอกุดบาก' ,'อำเภอพรรณนานิคม' ,'อำเภอพังโคน' ,'อำเภอวาริชภูมิ' ,'อำเภอนิคมน้ำอูน' ,'อำเภอวานรนิวาส' ,'อำเภอคำตากล้า' ,'อำเภอบ้านม่วง' ,'อำเภออากาศอำนวย' ,'อำเภอสว่างแดนดิน' ,'อำเภอส่องดาว' ,'อำเภอเต่างอย' ,'อำเภอโคกศรีสุพรรณ' ,'อำเภอเจริญศิลป์' ,'อำเภอโพนนาแก้ว' ,'อำเภอภูพาน'  );
        //AMP[55][1]= new Array('-1','598' ,'599' ,'600' ,'601' ,'602' ,'603' ,'604' ,'605' ,'606' ,'607' ,'608' ,'609' ,'610' ,'611' ,'612' ,'613' ,'614' ,'615'  );
        //AMP[56]=new Array(2);
        //AMP[56][0]=new Array('-- อำเภอ --','อำเภอเมืองสงขลา' ,'อำเภอสทิงพระ' ,'อำเภอจะนะ' ,'อำเภอนาทวี' ,'อำเภอเทพา' ,'อำเภอสะบ้าย้อย' ,'อำเภอระโนด' ,'อำเภอกระแสสินธ์' ,'อำเภอรัตภูมิ' ,'อำเภอสะเดา' ,'อำเภอหาดใหญ่' ,'อำเภอนาหม่อม' ,'อำเภอควนเนียง' ,'อำเภอบางกล่ำ' ,'อำเภอสิงหนคร' ,'อำเภอคลองหอยโข่ง'  );
        //AMP[56][1]= new Array('-1','616' ,'617' ,'618' ,'619' ,'620' ,'621' ,'622' ,'623' ,'624' ,'625' ,'626' ,'627' ,'628' ,'629' ,'630' ,'631'  );
        //AMP[57]=new Array(2);
        //AMP[57][0]=new Array('-- อำเภอ --','อำเภอเมืองสตูล' ,'อำเภอควนโดน' ,'อำเภอควนกาหลง' ,'อำเภอท่าแพ' ,'อำเภอละงู' ,'อำเภอทุ่งหว้า' ,'กิ่งอำเภอมะนัง (ควนกาหลง)'  );
        //AMP[57][1]= new Array('-1','632' ,'633' ,'634' ,'635' ,'636' ,'637' ,'638'  );
        //AMP[58]=new Array(2);
        //AMP[58][0]=new Array('-- อำเภอ --','อำเภอเมืองสมุทรปราการ' ,'อำเภอบางบ่อ' ,'อำเภอบางพลี' ,'อำเภอพระประแดง' ,'อำเภอพระสมุทรเจดีย์' ,'กิ่งอำเภอบางเสาธง'  );
        //AMP[58][1]= new Array('-1','639' ,'640' ,'641' ,'642' ,'643' ,'644'  );
        //AMP[59]=new Array(2);
        //AMP[59][0]=new Array('-- อำเภอ --','อำเภอเมืองสมุทรสงคราม' ,'อำเภอบางคนที' ,'อำเภออัมพวา'  );
        //AMP[59][1]= new Array('-1','645' ,'646' ,'647'  );
        //AMP[60]=new Array(2);
        //AMP[60][0]=new Array('-- อำเภอ --','อำเภอเมืองสมุทรสาคร' ,'อำเภอกระทุ่มแบน' ,'อำเภอบ้านแพ้ว'  );
        //AMP[60][1]= new Array('-1','648' ,'649' ,'650'  );
        //AMP[61]=new Array(2);
        //AMP[61][0]=new Array('-- อำเภอ --','อำเภอเมืองสระแก้ว' ,'อำเภอคลองหาด' ,'อำเภอตาพระยา' ,'อำเภอวังน้ำเย็น' ,'อำเภอวัฒนานคร' ,'อำเภออรัญประเทศ' ,'อำเภอโคกสูง' ,'อำเภอเขาฉกรรจ์' ,'กิ่งอำเภอวังสมบูรณ์'  );
        //AMP[61][1]= new Array('-1','651' ,'652' ,'653' ,'654' ,'655' ,'656' ,'657' ,'658' ,'659'  );
        //AMP[62]=new Array(2);
        //AMP[62][0]=new Array('-- อำเภอ --','อำเภอเมืองสระบุรี' ,'อำเภอแก่งคอย' ,'อำเภอหนองแค' ,'อำเภอวิหารแดง' ,'อำเภอหนองแซง' ,'อำเภอบ้านหมอ' ,'อำเภอดอนพุต' ,'อำเภอหนองโดน' ,'อำเภอพระพุทธบาท' ,'อำเภอเสาไห้' ,'อำเภอมวกเหล็ก' ,'อำเภอวังม่วง' ,'อำเภอเฉลิมพระเกียรติ'  );
        //AMP[62][1]= new Array('-1','660' ,'661' ,'662' ,'663' ,'664' ,'665' ,'666' ,'667' ,'668' ,'669' ,'670' ,'671' ,'672'  );
        //AMP[63]=new Array(2);
        //AMP[63][0]=new Array('-- อำเภอ --','อำเภอเมืองสิงห์บุรี' ,'อำเภอบางระจัน' ,'อำเภอค่ายบางระจัน' ,'อำเภอพรหมบุรี' ,'อำเภอท่าช้าง' ,'อำเภออินทร์บุรี'  );
        //AMP[63][1]= new Array('-1','673' ,'674' ,'675' ,'676' ,'677' ,'678'  );
        //AMP[64]=new Array(2);
        //AMP[64][0]=new Array('-- อำเภอ --','อำเภอเมืองสุโขทัย' ,'อำเภอบ้านด่านลานหอย' ,'อำเภอคีรีมาศ' ,'อำเภอกงไกรลาศ' ,'อำเภอศรีสัชนาลัย' ,'อำเภอศรีสำโรง' ,'อำเภอสวรรคโลก' ,'อำเภอศรีนคร' ,'อำเภอทุ่งเสลี่ยม'  );
        //AMP[64][1]= new Array('-1','679' ,'680' ,'681' ,'682' ,'683' ,'684' ,'685' ,'686' ,'687'  );
        //AMP[65]=new Array(2);
        //AMP[65][0]=new Array('-- อำเภอ --','อำเภอเมืองสุพรรณบุรี' ,'อำเภอเดิมบางนางบวช' ,'อำเภอด่านช้าง' ,'อำเภอบางปลาม้า' ,'อำเภอศรีประจันต์' ,'อำเภอดอนเจดีย์' ,'อำเภอสองพี่น้อง' ,'อำเภอสามชุก' ,'อำเภออู่ทอง' ,'อำเภอหนองหญ้าไซ'  );
        //AMP[65][1]= new Array('-1','688' ,'689' ,'690' ,'691' ,'692' ,'693' ,'694' ,'695' ,'696' ,'697'  );
        //AMP[66]=new Array(2);
        //AMP[66][0]=new Array('-- อำเภอ --','อำเภอเมืองสุราษฎร์ธานี' ,'อำเภอท่าชนะ' ,'อำเภอคีรีรัฐนิคม' ,'อำเภอบ้านตาขุน' ,'อำเภอพนม' ,'อำเภอท่าฉาง' ,'อำเภอบ้านนาสาร' ,'อำเภอบ้านนาเดิม' ,'อำเภอเคียนซา' ,'อำเภอเวียงสระ' ,'อำเภอพระแสง' ,'อำเภอพุนพิน' ,'อำเภอชัยบุรี' ,'อำเภอดอนสัก' ,'อำเภอเกาะสมุย' ,'อำเภอไชยา' ,'อำเภอกาญจนดิษฐ์' ,'อำเภอเกาะพะงัน' ,'กิ่งอำเภอวิภาวดี (คีรีรัฐนิคม)'  );
        //AMP[66][1]= new Array('-1','698' ,'699' ,'700' ,'701' ,'702' ,'703' ,'704' ,'705' ,'706' ,'707' ,'708' ,'709' ,'710' ,'711' ,'712' ,'713' ,'714' ,'715' ,'716'  );
        //AMP[67]=new Array(2);
        //AMP[67][0]=new Array('-- อำเภอ --','อำเภอเมืองสุรินทร์' ,'อำเภอชุมพลบุรี' ,'อำเภอท่าตูม' ,'อำเภอจอมพระ' ,'อำเภอปราสาท' ,'อำเภอกาบเชิง' ,'อำเภอรัตนบุรี' ,'อำเภอสนม' ,'อำเภอศรีขรภูมิ' ,'อำเภอสังขะ' ,'อำเภอลำดวน' ,'อำเภอสำโรงทาบ' ,'อำเภอบัวเชด' ,'กิ่งอำเภอพนมดงรัก' ,'กิ่งอำเภอศรีณรงค์' ,'กิ่งอำเภอเขวาสินรินทร์' ,'กิ่งอำเภอโนนนารายณ์'  );
        //AMP[67][1]= new Array('-1','717' ,'718' ,'719' ,'720' ,'721' ,'722' ,'723' ,'724' ,'725' ,'726' ,'727' ,'728' ,'729' ,'730' ,'731' ,'732' ,'733'  );
        //AMP[68]=new Array(2);
        //AMP[68][0]=new Array('-- อำเภอ --','อำเภอเมืองหนองคาย' ,'อำเภอท่าบ่อ' ,'อำเภอบึงกาฬ' ,'อำเภอพรเจริญ' ,'อำเภอโพนพิสัย' ,'อำเภอโซ่พิสัย' ,'อำเภอศรีเชียงใหม่' ,'อำเภอสังคม' ,'อำเภอเซกา' ,'อำเภอปากคาด' ,'อำเภอบึงโขงหลง' ,'อำเภอศรีวิไล' ,'อำเภอบุ้งคล้า' ,'กิ่งอำเภอสระใคร' ,'กิ่งอำเภอเฝ้าไร่' ,'กิ่งอำเภอรัตนวาปี' ,'กิ่งอำเภอโพธิ์ตาก'  );
        //AMP[68][1]= new Array('-1','734' ,'735' ,'736' ,'737' ,'738' ,'739' ,'740' ,'741' ,'742' ,'743' ,'744' ,'745' ,'746' ,'747' ,'748' ,'749' ,'750'  );
        //AMP[69]=new Array(2);
        //AMP[69][0]=new Array('-- อำเภอ --','อำเภอเมืองหนองบัวลำภู' ,'อำเภอนากลาง' ,'อำเภอโนนสัง' ,'อำเภอศรีบุญเรือง' ,'อำเภอสุวรรณคูหา' ,'อำเภอนาวัง'  );
        //AMP[69][1]= new Array('-1','751' ,'752' ,'753' ,'754' ,'755' ,'756'  );
        //AMP[70]=new Array(2);
        //AMP[70][0]=new Array('-- อำเภอ --','อำเภอเมืองอ่างทอง' ,'อำเภอไชโย' ,'อำเภอป่าโมก' ,'อำเภอโพธิ์ทอง' ,'อำเภอแสวงหา' ,'อำเภอวิเศษชัยชาญ' ,'อำเภอสามโก้'  );
        //AMP[70][1]= new Array('-1','757' ,'758' ,'759' ,'760' ,'761' ,'762' ,'763'  );
        //AMP[71]=new Array(2);
        //AMP[71][0]=new Array('-- อำเภอ --','อำเภอเมืองอำนาจเจริญ' ,'อำเภอหัวตะพาน' ,'อำเภอลืออำนาจ' ,'อำเภอเสนางคนิคม' ,'อำเภอชานุมาน' ,'อำเภอปทุมราชวงศา' ,'อำเภอพนา'  );
        //AMP[71][1]= new Array('-1','764' ,'765' ,'766' ,'767' ,'768' ,'769' ,'770'  );
        //AMP[72]=new Array(2);
        //AMP[72][0]=new Array('-- อำเภอ --','อำเภอเมืองอุดรธานี' ,'อำเภอกุดจับ' ,'อำเภอหนองวอซอ' ,'อำเภอกุมวาปี' ,'อำเภอโนนสะอาด' ,'อำเภอหนองหาน' ,'อำเภอทุ่งฝน' ,'อำเภอไชยวาน' ,'อำเภอศรีธาตุ' ,'อำเภอวังสามหมอ' ,'อำเภอบ้านดุง' ,'อำเภอบ้านผือ' ,'อำเภอน้ำโสม' ,'อำเภอเพ็ญ' ,'อำเภอสร้างคอม' ,'อำเภอหนองแสง' ,'อำเภอนายูง' ,'อำเภอพิบูลย์รักษ์' ,'กิ่งอำเภอกู่แก้ว' ,'กิ่งอำเภอประจักษ์ศิลปาคม'  );
        //AMP[72][1]= new Array('-1','771' ,'772' ,'773' ,'774' ,'775' ,'776' ,'777' ,'778' ,'779' ,'780' ,'781' ,'782' ,'783' ,'784' ,'785' ,'786' ,'787' ,'788' ,'789' ,'790'  );
        //AMP[73]=new Array(2);
        //AMP[73][0]=new Array('-- อำเภอ --','อำเภอเมืองอุตรดิตถ์' ,'อำเภอตรอน' ,'อำเภอท่าปลา' ,'อำเภอน้ำปาด' ,'อำเภอฟากท่า' ,'อำเภอบ้านโคก' ,'อำเภอพิชัย' ,'อำเภอลับแล' ,'อำเภอทองแสนขัน'  );
        //AMP[73][1]= new Array('-1','791' ,'792' ,'793' ,'794' ,'795' ,'796' ,'797' ,'798' ,'799'  );
        //AMP[74]=new Array(2);
        //AMP[74][0]=new Array('-- อำเภอ --','อำเภอเมืองอุทัยธานี' ,'อำเภอทัพทัน' ,'อำเภอสว่างอารมณ์' ,'อำเภอหนองฉาง' ,'อำเภอหนองขาหย่าง' ,'อำเภอบ้านไร่' ,'อำเภอลานสัก' ,'อำเภอห้วยคด'  );
        //AMP[74][1]= new Array('-1','800' ,'801' ,'802' ,'803' ,'804' ,'805' ,'806' ,'807'  );
        //AMP[75]=new Array(2);
        //AMP[75][0]=new Array('-- อำเภอ --','อำเภอเมืองอุบลราชธานี' ,'อำเภอศรีเมืองใหม่' ,'อำเภอโขงเจียม' ,'อำเภอเขื่องใน' ,'อำเภอเขมราฐ' ,'อำเภอเดชอุดม' ,'อำเภอนาจะหลวย' ,'อำเภอน้ำยืน' ,'อำเภอบุญฑริก' ,'อำเภอตระการพืชผล' ,'อำเภอกุดข้าวปุ้น' ,'อำเภอม่วงสามสิบ' ,'อำเภอวารินชำราบ' ,'อำเภอพิบูลมังสาหาร' ,'อำเภอตาลสุม' ,'อำเภอโพธิ์ไทร' ,'อำเภอสำโรง' ,'อำเภอดอนมดแดง' ,'สิรินธร' ,'อำเภอทุ่งศรีอุดม' ,'กิ่งอำเภอนาเยีย' ,'กิ่งอำเภอนาตาล' ,'กิ่งอำเภอเหล่าเสือโก้ก' ,'กิ่งอำเภอสว่างวีรวงศ์' ,'กิ่งอำเภอน้ำขุ่น'  );
        //AMP[75][1]= new Array('-1','808' ,'809' ,'810' ,'811' ,'812' ,'813' ,'814' ,'815' ,'816' ,'817' ,'818' ,'819' ,'820' ,'821' ,'822' ,'823' ,'824' ,'825' ,'826' ,'827' ,'828' ,'829' ,'830' ,'831' ,'832'  );

        #endregion _geocodeToAmphoeCom

        #endregion consts

        /// <summary>
        /// Gets the URL on amphoe.com for the given geocode.
        /// </summary>
        /// <param name="geocode">Geocode of the district.</param>
        /// <returns>URL at amphoe.com, or <c>null</c> if no valid URL can be found.</returns>
        public static Uri AmphoeWebsite(UInt32 geocode)
        {
            Int16 provinceCode = 0;
            if ( _provinceToAmphoeCom.TryGetValue(geocode / 100, out provinceCode) )
            {
                Int16 amphoeCode = 0;
                if ( _geocodeToAmphoeCom.TryGetValue(geocode, out amphoeCode) )
                {
                    return new Uri(String.Format("http://www.amphoe.com/menu.php?mid=1&am={0}&pv={1}", amphoeCode, provinceCode));
                }
            }
            return null;
        }
    }
}